{

  "Transport - HTTP - CSP": "Content Security Policy (CSP) is a feature that helps to prevent or minimize the risk of certain types of security threats.",
  "Transport - HTTPS": ".",
  "Transport - HSTS": ".",
  "Transport - WS-Security": "",

  "Tokens": "SECTION",
	"Tokens - JWT": "JWT (RFC 7519) for securely transmitting information between parties as a JSON object.",
  "Tokens - JWT - Structure - Payload - Claim": "A compact and self-contained way to represent a set of claims securely between two parties.",
  "Tokens - JWT - Structure - Payload - Claim - Structure": "From the text, we can understand that JWT is not a structure but a set of claims in the shape of either JWS or JWE as its way of securing itself. In the most basic form, the difference between JWS and JWE is that everyone can see the payload of JWS while the JWE one is encrypted.",
  "Tokens - JWT - Usage": "JSON Web Token (JWT) is an abstract that is represented in the form of JSON Web Signature (JWS) and JSON Web Encryption (JWE).",
  "Tokens - JWT - Usage - Benefits - Statelessness": "server doesn't need to store session information.",
  "Tokens - JWT - Usage - Benefits - Security": "can be signed using various algorithms",
  "Tokens - JWT - Usage - Benefits - Decentralization": "ideal for single sign-on (SSO).",
  "Tokens - JWA": "JWA (RFC 7518), which stands for JSON Web Algorithm, is a specification defining which hashing and encryption algorithm to make a JWT.",
  "Tokens - JWA - Usage": "JSON Web Signature (JWS) and JSON Web Encryption (JWE) use signature and encryption algorithms defined in JSON Web Algorithm (JWA) as a way of securing themselves.",
  "Tokens - JWA - Usage - BestPractices - Asymmetry": "Prioritize Asymmetry: Use RS256 (RSA) or ES256 (Elliptic Curve) for stronger security.",
  "Tokens - JWA - Usage - BestPractices - HS256": "Avoid HS256: HMAC-based signing (HS256) requires careful key management.",
  "Tokens - JWA - Usage - BestPractices - none": "Never Use 'none': This disables signing, rendering JWTs completely insecure.",
	"Tokens - JWK": "JWK (RFC 7517) stands for JSON Web Key. JWK is a JSON data structure that contains information about hashing function's cryptographic key. It's a way to store your hashing key in JSON format.",
  "Tokens - JWK - Usage": "The public key of the signature algorithm defined in the JSON Web Algorithm (JWA) can be hosted as JSON Web Key (JWK).",
  "Tokens - JWK - Usage - BestPractices - keys": "◾ Generate robust, cryptographically secure keys (256-bit or higher)",
  "Tokens - JWK - Usage - BestPractices - rotate": "◾ Regularly rotate keys.",
  "Tokens - JWKS": "JWKS is a set of public keys that can be used to verify the JWTs issued by a specific authorization server.",
  "Tokens - JWKS - Usage": "verify any JSON Web Token (JWT) issued by the Authorization Server and signed using the RS256 signing algorithm. ",
	"Tokens - JWS": "A signed JWT. JWS (RFC 7515), which stands for JSON Web Signature, is one of the structures used by JWT. It's the most common implementation of the JWT.",
  "Tokens - JWS - Security": "The signature only provides integrity, not confidentiality. The JWT is secure because only the one with the secret key can create it.",
  "Tokens - JWS - Algorithms": "Signing algos (HS256, etc)",
  "Tokens - JWS - Structure": "3 components: Three Base64-URL string generated by dots: Header.Payload.Signature",
  "Tokens - JWS - Structure - Header": "Contains metadata about the token.",
  "Tokens - JWS - Structure - Header - alg": "The signing algorithm (e.g., HS256, RS256, ES256).",
  "Tokens - JWS - Structure - Header - typ": "The type of token (usually 'JWT')",
  "Tokens - JWS - Structure - Payload": "◾ Contains the claims (statements) about an entity (typically, the user) and additional data.",
  "Tokens - JWS - Structure - Payload - Readable": "Well, the payload of the JWS is intended for everyone to read. What makes the JWT safe is the consumer can verify who is the one issued the JWT.",
  "Tokens - JWS - Structure - Payload - Claims": "",
  "Tokens - JWS - Structure - Payload - Claims - Registered": "Registered claims (standardized). Standard fields (optional but recommended)",
  "Tokens - JWS - Structure - Payload - Claims - Registered - iss": "iss (issuer)",
  "Tokens - JWS - Structure - Payload - Claims - Registered - sub": "sub (subject)",
  "Tokens - JWS - Structure - Payload - Claims - Registered - aud": "aud (audience)",
  "Tokens - JWS - Structure - Payload - Claims - Registered - exp": "exp (expiration time)",
  "Tokens - JWS - Structure - Payload - Claims - Registered - nbf": "nbf (not before time)",
  "Tokens - JWS - Structure - Payload - Claims - Registered - iat": "iat (issued at time)",
  "Tokens - JWS - Structure - Payload - Claims - Registered - jti": "jti (unique identifier)",
  "Tokens - JWS - Structure - Payload - Claims - Public": "Public claims (customizable by your application). Custom fields (should be defined in IANA registry or use URIs)",
  "Tokens - JWS - Structure - Payload - Claims - Private": "Private claims (application-specific agreements). Custom fields agreed between parties",
  "Tokens - JWS - Structure - Signature": "Used to verify the token's authenticity and integrity. Used to verify the message wasn't changed along the way",
  "Tokens - JWS - Structure - Signature - Structure": "signature = algorithm(base64UrlEncode(header) + '.' + base64UrlEncode(payload), secret_key)",
	"Tokens - JWS - Process - Generation": "Token Creation: The server generates a JWT when the user logs in.",
  "Tokens - JWS - Process - Transmission": "This token is sent to the client (e.g., browser).",
  "Tokens - JWS - Process - Usage": "For subsequent requests, the client sends the JWT, which the server verifies before granting access.",
	"Tokens - JWS - Process - Usage - BestPractices - Storage": "Store keys securely, never in source code or version control.",
  "Tokens - JWS - Process - Usage - BestPractices - TokenHandling - HTTPS": "Transmit JWTs exclusively over HTTPS to prevent interception.",
  "Tokens - JWS - Process - Usage - BestPractices - TokenHandling - HttpOnly": "Store JWTs in HttpOnly cookies to protect against cross-site scripting (XSS) attacks.",
  "Tokens - JWS - Process - Usage - BestPractices - TokenHandling - Expiration": "Set short expiration times and consider refresh tokens for longer sessions.",
  "Tokens - JWS - Process - Usage - BestPractices - TokenHandling - Revoke": "Implement mechanisms for revoking compromised tokens =>blacklists, short-lived tokens.",
  "Tokens - JWS - Process - Usage - BestPractices - ValidationAndVerification - verify": "ALWAYS verify the JWT signature using the appropriate algorithm and key before processing the claims.",
  "Tokens - JWS - Process - Usage - BestPractices - ValidationAndVerification - claims": "Check all relevant claims (exp, iss, aud) for validity and relevance to your application.",
	"Tokens - JWE": "An encrypted JWT. JWE (RFC 7516), unlike JWS, encrypts its content using an encryption algorithm.",
  "Tokens - JWE - Security": "The only one that can see what is inside the JWT is the one with the key.",
  "Tokens - JWE - Algorithms": "Encryption algos (AES, etc)",
  "Tokens - JWE - Structure": "5 components: Base64Url(Header).Base64Url(Encrypted Key).Base64Url(Initialization Vector).Base64Url(Ciphertext).Base64Url(Authentication Tag)",
  "Tokens - JWE - Structure - Header": "BASE64URL(UTF8(JWE Protected Header)) || ’.’ ||",
  "Tokens - JWE - Structure - EncryptedKey": "BASE64URL(JWE Encrypted Key) || ’.’ ||",
  "Tokens - JWE - Structure - InitializationVector": "BASE64URL(JWE Initialization Vector) || ’.’ ||",
  "Tokens - JWE - Structure - Ciphertext": "BASE64URL(JWE Ciphertext) || ’.’ ||",
  "Tokens - JWE - Structure - AuthenticationTag": "BASE64URL(JWE Authentication Tag",
  "Tokens - JWE - Process - KeyGeneration": "A random Content Encryption Key (CEK) is generated",
  "Tokens - JWE - Process - KeyEncryption": "The CEK is encrypted using the recipient's public key (using the alg specified)",
  "Tokens - JWE - Process - PayloadEncryption": "The actual data is encrypted with the CEK (using the enc algorithm)",
  "Tokens - JWE - Process - Serialization": "All components are base64url encoded and concatenated",

  "Authorization": "SECTION",
	"Authorization - goal": "access to data. Authorization determines permissions (e.g., access levels).",
	"Authorization - OAuth": "OAuth (Open Authorization) is an open-standard authorization framework that allows third-party applications to access user data from a service (like Google, Facebook, or GitHub) without exposing the user's credentials. Instead, it provides secure, delegated access using access tokens.",
	"Authorization - OAuth - Features - deprecated": ".",
	"Authorization - OAuth - Features - Passwordless": "Allows users to grant applications access without sharing passwords..",
	"Authorization - OAuth - Features - Security": "Required complex cryptographic signing.",
	"Authorization - OAuth - Features - Tokens": "Instead of passwords, OAuth uses short-lived tokens for secure API access.",
	"Authorization - OAuth - Features - Usage": "Less flexible for modern apps.",
	"Authorization - OAuth - Flow - UserRequestsAccess": "App asks the user to authorize access via an OAuth provider (e.g., Google).",
	"Authorization - OAuth - Flow - AuthorizationGrant": "User logs in and approves the requested permissions. The provider gives the app an authorization code.",
	"Authorization - OAuth - Flow - TokenExchange": "The app exchanges the code for an access token (and optionally a refresh token).",
	"Authorization - OAuth - Flow - APIAccess": "The app uses the access token to fetch data from the provider's API.",
	"Authorization - OAuth2": "",
	"Authorization - OAuth2 - Features - Security": "Simpler, uses HTTPS (not cryptographic signatures).",
	"Authorization - OAuth2 - Features - Tokens": "Uses Bearer Tokens (like JWT).",
	"Authorization - OAuth2 - Features - Usage": "Supports mobile & web apps better.",
	"Authorization - OAuth2 - access_token": "Used to call APIs on behalf of the user. Think of this as a pass granting limited rights to a third-party service.",

	"Authentication": "SECTION",
	"Authentication - goal": "who is the user. Authentication verifies identity (e.g., login)",
	"Authentication - BASIC": "",
	"Authentication - APIKey": "API keys are supposed to be a secret that only the client and server know. Like Basic authentication, API key-based authentication is only considered secure if used together with other security mechanisms such as HTTPS/SSL.",
	"Authentication - Credentials": "The First Line of Defense. The classic method—username and password. But is it enough? Weak passwords are easily cracked; multi-factor authentication (MFA) is essential. The best practice? Use passphrases, password managers, and regular updates.",
	"Authentication - SSHKeys": "The Lock and Key for Secure Access. Used for remote access to systems without needing passwords. Stronger than traditional credentials—keys are complex and hard to guess. Must be properly managed to prevent unauthorized use or key leaks.",
	"Authentication - SSLCertificates": "The Silent Guardian of Secure Connections. Ensure encrypted communication between users and servers. Prevent man-in-the-middle attacks and unauthorized interception. A must-have for websites handling sensitive data, transactions, or logins.",
	"Authentication - SAML": "",
	"Authentication - OpenID": "",
	"Authentication - OpenID2.0": "",
  "Authentication - OIDC": "OpenID Connect or OIDC is an identity protocol that utilizes the authorization and authentication mechanisms of OAuth 2.0.",
  "Authentication - OIDC - id_token": "OIDC introduces the id_token, a JSON Web Token (JWT) that contains claims about the user's identity.",

	"SSO": "SECTION",
	"SSO - goal": "SSO allows users to authenticate once and access multiple applications without re-entering credentials.",
	"SSO - IdP": "An IdP is a trusted service that stores and manages user identities, including usernames, passwords, and permissions.",
	"SSO - IdP - Process": "Identity-Provider. IdP acts as a central authority for authentication, verifying user credentials and granting access to various applications.",
	"SSO - IdP - Process - 1. LogIn": "Users attempt to access an application (SP) directly and user would be presented with login options.",
	"SSO - IdP - Process - 2. Redirect": "Service Provider (LinkedIn) will redirect the user to the Identity Provider (Google) with an authentication request.",
	"SSO - IdP - Process - 3. Session": "Once the Identity Provider (Google) has received the request, it will check for an active session. If it doesn't find one, authentication will be requested.",
	"SSO - IdP - Process - 4. Submit": "At this stage, the user will submit their login credentials (username and password) to the Identity Provider (IdP).",
	"SSO - IdP - Process - 5. Verify": "The Identity Provider will then verify the submitted credentials against its User Directory (database). If the credentials are correct, the IdP will create an authentication token or assertion.",
	"SSO - IdP - Process - 6. Token": "Once authenticated, the IdP creates and provides a token or assertion to the Service Provider (SP) confirming the user's identity. The user is now authenticated and can access the Service Provier (LinkedIn)..",
	"SSO - IdP - Process - 7. Granted": "Since the Identity Provider has established a session, when the user goes to access a different Service Provider (eg; GitHub), they won't need to re-enter their credentials. Future service providers will request authentication from the Identity Provider, recognize the existing session, and grant access to the user based on the previously authenticated session.",
	"SSO - IdP - Tools - MicrosoftEntraID": "",
	"SSO - IdP - Tools - Okta": "",
	"SSO - IdP - Tools - JumpCloud": "",
	"SSO - Protocols - LDAP": ".",
	"SSO - Protocols - Kerberos": ".",
	"SSO - Protocols - SAML": ".",
	"SSO - Protocols - OAuth2": ".",
	"SSO - Protocols - OIDC": ".",
	"SSO - MFA": "",
  "SSO - CAS": "",

	"Web - OWASP": "",
  "Web - CORS": "https://javascript.plainenglish.io/cors-the-friendly-gatekeeper-of-the-web-and-how-to-fix-it-650e33179d24",
  "Web - XSS": "https://javascript.plainenglish.io/how-to-secure-your-frontend-in-2024-with-code-best-practices-for-modern-web-development-dc60921bb93a",

	"Standards - NIS2": "https://digital-strategy.ec.europa.eu/en/policies/nis2-directive"

}

