{

	"Cloud": "SECTION",
	"Cloud - AWSEKS": "Amazon Elastic Kubernetes Service (Amazon EKS) is a fully managed Kubernetes service that enables you to run Kubernetes seamlessly in both AWS Cloud and on-premises data centers.",
	"Cloud - AWSECS": "Amazon Elastic Container Service (Amazon ECS) is a fully managed container orchestration service that helps you to more efficiently deploy, manage, and scale containerized applications.",

	"Compute": "SECTION",
	"Compute - AWSLambda": "",
	"Compute - AWSLambda - Languages": "",
	"Compute - AWSLambda - Languages - NodeJS": "",
	"Compute - AWSLambda - Languages - Python": "",
	"Compute - AWSLambda - Languages - Java": "",
	"Compute - AWSLambda - Languages - Go": "",
	"Compute - AWSLambda - Languages - C#": "",
	"Compute - AWSLambda - Languages - PowerShell": "",
	"Compute - AWSLambda - Languages - Ruby": "",
	"Compute - AWSLambda - Invokation": "",
	"Compute - AWSLambda - Invokation - by AWS services": "",
	"Compute - AWSLambda - Invokation - by AWS services - S3": "S3Event",
	"Compute - AWSLambda - Invokation - by AWS services - Kinesis": "KinesisEvent",
	"Compute - AWSLambda - Invokation - by AWS services - SQS": "",
	"Compute - AWSLambda - Invokation - by AWS services - SNS": "SNSEvent",
	"Compute - AWSLambda - Invokation - by AWS services - Cognito": "CognitoEvent",
	"Compute - AWSLambda - Invokation - by AWS services - DynamoDB": "DynamodbEvent",
	"Compute - AWSLambda - Invokation - by AWS services - CloudTrail": "",
	"Compute - AWSLambda - Invokation - by API Gateway (HTTPS)": "APIGatewayProxyRequestEvent  - You can invoke AWS Lambda functions over HTTPS",
	"Compute - AWSLambda - Invokation - by API Gateway - multiple": "You can do this by defining a custom REST API and endpoint using Amazon API Gateway, and then mapping individual methods, such as GET and PUT, to specific Lambda functions.",
	"Compute - AWSLambda - Invokation - by API Gateway - unique": "You could add a special method named ANY to map all supported methods (GET, POST, PATCH, DELETE) to your Lambda function. When you send an HTTPS request to the API endpoint, the Amazon API Gateway service invokes the corresponding Lambda function.",
	"Compute - AWSLambda - Invokation - by Custom Events": "",
	"Compute - AWSLambda - Invokation - by Scheduled events": "",
	"Compute - AWSElasticBeanStalk": ".",
	"Compute - AWSFargate": "AWS Fargate is a serverless, pay-as-you-go compute engine that lets you focus on building applications without managing servers.",
	"Compute - AWSECS ": "https://ajmmertens.medium.com/building-an-ecs-storage-in-pictures-642b8bfd6e04",
	"Compute - AWSEC2 - Instances - R": "R = Memory Optimised. The “R” refers to optimised memory usage of each resource type. R instances are geared for workloads that require more memory in relation to the CPU.",
	"Compute - AWSEC2 - Instances - C": "C = Compute Optimised, and so on.",
	"Compute - AWSEC2 - Instances - M": "M Instances: general-purpose instances and provide a balanced amount of CPU, memory, and network resources.. Examples of M Instance Types: M5, M6g",

	"Middleware": "",
	"Middleware - AWSSQS": "Amazon SQS is a highly reliable, scalable message queuing service that enables asynchronous message-based communication between distributed components of an application.",
	"Middleware - AWSSQS - Reliability": "No message is ever lost in the interim, each message is persistently stored in highly available, highly reliable queues.",
	"Middleware - AWSSQS - Complexity": "SQS is dead-simple to use. Simply create a queue, and send messages to it.",
	"Middleware - AWSSQS - Queue Types": "Amazon SQS offers two queue types for different application requirements: Standard Queues and FIFO Queues",
	"Middleware - AWSSQS - Queue Types - Standard Queues": "",
	"Middleware - AWSSQS - Queue Types - Standard Queues - Throughput": "Unlimited Throughput: Standard queues support a nearly unlimited number of transactions per second (TPS) per API action.",
	"Middleware - AWSSQS - Queue Types - Standard Queues - Delivery": "At-Least-Once Delivery: A message is delivered at least once, but occasionally more than one copy of a message is delivered.",
	"Middleware - AWSSQS - Queue Types - Standard Queues - Ordering": "Best-Effort Ordering: Occasionally, messages might be delivered in an order different from which they were sent.",
	"Middleware - AWSSQS - Queue Types - Standard Queues - Use Cases": "",
	"Middleware - AWSSQS - Queue Types - FIFO Queues": "",
	"Middleware - AWSSQS - Queue Types - FIFO Queues - Throughput": "High Throughput: By default, FIFO queues support up to 300 messages per second (300 send, receive, or delete operations per second). When you batch 10 messages per operation (maximum), FIFO queues can support up to 3,000 messages per second. To request a limit increase, file a support request.",
	"Middleware - AWSSQS - Queue Types - FIFO Queues - Delivery": "Exactly-Once Processing: A message is delivered once and remains available until a consumer processes and deletes it. Duplicates aren't introduced into the queue.",
	"Middleware - AWSSQS - Queue Types - FIFO Queues - Ordering": "First-In-First-Out Delivery: The order in which messages are sent and received is strictly preserved (i.e. First-In-First-Out).",
	"Middleware - AWSSQS - Queue Types - FIFO Queues - Use Cases": "",
	"Middleware - AWSSNS": "",

	"Storage": "SECTION",
	"Storage - AWSNeptune": "",
	"Storage - AWSElasticCache": "",
	"Storage - AWSRDS": "",
	"Storage - AWSDynamoDB": "",
	"Storage - AWSDocumentDB": "",
	"Storage - AWSAurora": "",
	"Storage - AWSS3": "",
	"Storage - AWSEFS": "",
	"Storage - AWSEBS": "",

	"Network": "SECTION",
	"Network - AWSRegions": "",
	"Network - AWSRegions - AZ - descc": "Availability Zones (AZs) are isolated locations within an AWS Region.",
	"Network - AWSRegions - AZ - multiple": "Each of the AWS regions has multiple Availability Zones implemented under them, and each availability zone is built to be isolated from any other.",
	"Network - AWSRegions - AZ - location": "However, the naming doesn’t correspond with the real location of the physical data centre.",
	"Network - AWSRegions - AZ - AZ ID": "Availability Zone names are unique and you can only use the ID for that account in those Availability Zones. It is across from all AWS accounts, with the same ID.",
	"Network - AWSRegions - infra": "",
	"Network - AWSRegions - infra - InternetGateway": "",
	"Network - AWSRegions - infra - RouteTable": "",
	"Network - AWSRegions - ": "",
	"Network - AWSCloudFormation": "",
	"Network - AWSCDK": "",

	"CICD": "SECTION",
	"CICD - Security ": "",
	"CICD - Security - AWSIAMS - SecurityGroups": "",
	"CICD - Security - AWSCognito": "",
	"CICD - Development - AWSCodePipeline": "",
	"CICD - Audit - AWSCloudWatch": "",
	"CICD - AWSKMS": ""
	
}