{

	"Brokers - Mosquito": "",
	"Brokers - Pushy": "",
	"Brokers - VerneMQ": "",
	"Brokers - IBM Bluemix": "",
	"Brokers - IBM IoT MessageSight": "",
	"Brokers - IBM WebSphere MQ Telemetry": "",
	"Brokers - HiveMQ": "",
	"Brokers - Azure IoT": "",
	"Brokers - ThingMQ": "",
	"Brokers - ThingStudio": "",
	"Brokers - cloudMQTT": "",
	"Brokers - Heroku CloudMQTT": "",
	"Brokers - MachineHead": "",
	"Brokers - Mercury": "This is a message broker that enables some common messaging patterns over WebSockets.",
	"Brokers - JMS PTP": "",
	"Brokers - ZeroMQ": "",
	"Brokers - AWS SQS": "",
	"Brokers - AWS SNS": "",
	"Brokers - AWS Kinesis": "",
	"Brokers - AWS AmazonMQ": "",
	"Brokers - Microsoft Azure Event Hubs": "",
	"Brokers - Google pub/sub": "",
	"Brokers - Spark Streams": "",

  "RabbitMQ": "SECTION",
  "RabbitMQ - Features - OptimizedFor": "The Lightweight and Versatile Choice. Best for: Task queues, real-time messaging, and microservices communication. Choose RabbitMQ for lightweight messaging and quick integrations.",
  "RabbitMQ - Features - Strength": "Built on the AMQP protocol, enabling reliable message delivery. Supports message acknowledgment, flexible routing, and prioritization. Easy setup and integration across multiple languages.",
  "RabbitMQ - Features - TypicalUseCase:": "Asynchronous workflows like email notifications or order processing.",

  "ActiveMQ": "SECTION",
  "ActiveMQ - Features - OptimizedFor": "The Enterprise-Ready Solution Best for: Protocol-heavy enterprise systems and legacy integrations. Go with ActiveMQ for robust, enterprise-level messaging needs.",
  "ActiveMQ - Features - Strength": "Supports a variety of messaging protocols (AMQP, MQTT, JMS). Rich support for traditional patterns like point-to-point and publish/subscribe. Reliable and proven in enterprise environments.",
  "ActiveMQ - Features - TypicalUseCase": "Integrating legacy systems with modern apps or cross-protocol communication.",

  "Kafka": "SECTION",
	"Kafka - Features": "Apache Kafka is developed in Scala and started out at LinkedIn. Kafka only provides a total order over messages within a partition, not between different partitions in a topic.",
  "Kafka - Features - OptimizedFor": "The Real-Time Data Streamer. Best for: High-throughput event streaming, big data pipelines, and log aggregation. Pick Kafka for large-scale, real-time event-driven systems.",
  "Kafka - Features - Strength": "Distributed and partitioned for scalability and fault-tolerance. Optimized for event-driven architectures and real-time analytics. Includes stream processing capabilities via Kafka Streams and KSQL.",
  "Kafka - Features - TypicalUseCase": "Streaming IoT data or powering real-time financial dashboards.",
  "Kafka - Advantages": "Kafka can handle multiple producers and consumers, while providing disk-based data retention and high scalability. ",
  "Kafka - KafkaMessage ": "Message is the basic unit of data in Kafka. It consists of headers, key, and value. ",
  "Kafka - KafkaTopics ": "Messages are organized into topics, which are divided into partitions for scalability. Every message goes to a particular Topic. Topics have multiple partitions.",
  "Kafka - KafkaTopics - RetentionPolicy": "Adjust log.retention.hours & segment.bytes wisely.",
	"Kafka - KafkaPartitions": "",
	"Kafka - KafkaPartitions - Strategies": "",
	"Kafka - KafkaProducer ": "Producers in Kafka create new messages, batch them, and send them to a Kafka topic.",
	"Kafka - KafkaProducer - Tuning": "Set acks=all, tweak linger.ms & batch.size for efficiency.",
	"Kafka - KafkaProducer - Idempotent": "Enable enable.idempotence=true for exactly-once delivery.",
	"Kafka - KafkaConsumer ": "Kafka consumers work together as a consumer group to read messages from the broker. ",
	"Kafka - KafkaConsumer - Balanced": "Ensure even consumer distribution across partitions.",
	"Kafka - KafkaCluster ": "A Kafka cluster consists of several brokers where each partition is replicated across multiple brokers to provide high availability and redundancy. ",
	"Kafka - UseCases - MonitorLag ": "Use Kafka Manager or Prometheus to track consumer lag.",
	"Kafka - UseCases - StreamProcessing ": "Use Kafka Streams or Flink for real-time processing.",

	"Bufstream": "SECTION",
	"Bufstream ": "https://www.linkedin.com/posts/nikkisiapno_kafka-vs-bufstream-whats-the-difference-activity-7307343842318462976-Agz1/"

}