{

  "Cryptography - Keys": "SECTION",
  "Cryptography - Keys ": "https://asecuritysite.com/",
  "Cryptography - Keys - Compression": "",
  "Cryptography - Keys - Hashing": "",
  "Cryptography - Keys - Hashing - HashFunction": "",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - Classic - MD5": "",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - Classic - SHA-1": "",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - Classic - SHA-2": "",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - Classic - BLAKE2b": "",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - Classic - SHAKE128": "",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - Classic - SHAKE2s256": "",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - Classic - SM3": "",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - Classic - RIPEMD160": "",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - PQC - SHA-256": "SHA-256 is a cryptographic hash function used for data integrity and digital signatures. It takes an input (message) and produces a fixed-size hash value, typically 256 bits long. Its primary purpose is to verify the integrity of data and create a unique representation of a message.",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - PQC - SHA-384": ".",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - PQC - SHA-512": ".",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - PQC - SHA3-256": ".",
  "Cryptography - Keys - Hashing - HashFunction - Algorithms - PQC - SHA3-512": ".",
	"Cryptography - Keys - Hashing - Applications - Storage - Data - Formats - MerkleTrie": "A hash tree or Merkle tree is a tree in which every 'leaf' node is labelled with the cryptographic hash of a data block, and every node that is not a leaf (called a branch, inner node, or inode) is labelled with the cryptographic hash of the labels of its child nodes.",
	"Cryptography - Keys - Hashing - Applications - Storage - Data - Formats - RadixTrie": "A radix tree (also radix trie or compact prefix tree or compressed trie) is a data structure that represents a space-optimized trie (prefix tree) in which each node that is the only child is merged with its parent.",
  "Cryptography - Keys - Hashing - Applications - Storage - Data - Formats - PatriciaTrie": "A Patricia trie (the Practical Algorithm To Retrieve Information Coded in Alphanumeric) is a binary radix trie resulting from the application of the PATRICIA algorithm to alphnumeric data.",
  "Cryptography - Keys - Hashing - Applications - Storage - Data - Formats - MerkelPatriciaTrie": "Merkle Patricia Trie is a data structure that stores key-value pairs, just like a map. In additional to that, it also allows us to verify data integrity and the inclusion of a key-value pair.",
  "Cryptography - Keys - Hashing - Applications - Storage - Data - Formats - VerkleTrie": "Verkle Trees have a tree-like structure similar to Merkle Trees, but with a more efficient vector commitment scheme. Instead of hashing the d nodes, each node commits to the d nodes themselves using a vector commitment scheme.",
	"Cryptography - Keys - Encryption - Symmetric": "Symmetric encryption is a type of encryption key management solution where only one key (a secret key) is used to both encrypt and decrypt electronic data. In case of symmetric encryption, only public keys are used.",
  "Cryptography - Keys - Encryption - Symmetric - Operations - Encryption": "",
	"Cryptography - Keys - Encryption - Symmetric - Operations - Encryption - Algorithms": "",
  "Cryptography - Keys - Encryption - Symmetric - Operations - Encryption - Algorithms - Classic - AES": "AES is a symmetric-key encryption algorithm used for securing data. It’s primarily used for encrypting and decrypting data to maintain its confidentiality.",
  "Cryptography - Keys - Encryption - Symmetric - Operations - Encryption - Algorithms - Classic - ChaCha20": "",
  "Cryptography - Keys - Encryption - Symmetric - Operations - Encryption - Algorithms - PQC - 256bitAES": "",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange": "Key exchange (also key establishment) is a method in cryptography by which cryptographic keys are exchanged between two parties, allowing use of a cryptographic algorithm.",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange - goal": "Key exchange is used to establish a shared secret key for symmetric encryption.",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange - features - mechanism": "Both parties actively participate in the key generation process. Interactive process.",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange - features - shared": "The shared key is derived from the contributions of both parties.",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange - mechanism": "Key exchange protocols often rely on asymmetric encryption or mathematical problems (e.g., discrete logarithm, elliptic curves) to securely establish the shared secret.",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange - algorithms": "",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange - algorithms - Classic - DH": "Diffie-Helmlman, now known as Diffie-Helmlman-Merkle. A classic key exchange protocol where two parties generate a shared secret using modular exponentiation and their private keys.",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange - algorithms - Classic - ECDH": "The ECDH (Elliptic Curve Diffie–Hellman Key Exchange) is anonymous key agreement scheme, which allows two parties, each having an elliptic-curve public–private key pair, to establish a shared secret over an insecure channel. ",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange - algorithms - Classic - X25519": "",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange - algorithms - Classic - RSAKeyExchange": "",
	"Cryptography - Keys - Encryption - Symmetric - Operations - KeyExchange - algorithms - PQC - Kyber": "ML-KEM (FIPS 203, aka Kyber)",
	"Cryptography - Keys - Encryption - Asymmetric": "Asymmetric encryption, also known as public key encryption, uses a public key-private key pairing: data encrypted with the public key can only be decrypted with the private key.",
  "Cryptography - Keys - Encryption - Asymmetric - Key - Private": "This key is kept secret and is known only to the owner. It is used to decrypt data that has been encrypted with the corresponding public key or to create a digital signature.",
  "Cryptography - Keys - Encryption - Asymmetric - Key - Public": "This key is shared openly and can be distributed to anyone. It is used to encrypt data or to verify a digital signature.",
  "Cryptography - Keys - Encryption - Asymmetric - Features - slower": "Asymmetric encryption is generally slower than symmetric encryption (which uses the same key for both encryption and decryption) due to the complexity of the mathematical operations involved. Therefore, it is often used in combination with symmetric encryption, where asymmetric encryption is used to securely exchange the symmetric key, and symmetric encryption is used for the bulk of the data encryption.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption": "",
	"Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms": "",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms - RSA - 1977": "RSA algorithm, named after its inventors Rivest, Shamir, and Adleman. The RSA algorithm was developed in 1977 by Ron Rivest, Adi Shamir, and Leonard Adleman. It relies on the fact that factorization of large prime numbers requires significant computing power, and was the first algorithm to take advantage of the public key/private key paradigm. There are varying key lengths associated with RSA, with 2048-bit RSA key lengths being the standard for most websites today.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms - RSA - length": "RSA can work with keys of different keys of length: 1024, 2048, 3072, 4096, 8129, 16384 or even more bits. Key length of 3072-bits and above are considered secure. Longer keys provide higher security but consume more computing time, so there is a tradeoff between security and speed. Very long RSA keys (e.g. 50000 bits or 65536 bits) may be too slow for practical use, e.g. key generation may take from several minutes to several hours.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms - RSA - scope": "The RSA algorithm provides: KeyPairGeneration, Encryption, DigitalSignatures, KeyExchange",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms - RSA - scope - KeyPairGeneration": "Key-pair generation: generate random private key (typically of size 1024-4096 bits) and corresponding public key.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms - RSA - scope - Encryption": "Encryption: encrypt a secret message (integer in the range [0...key_length]) using the public key and decrypt it back using the secret key.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms - RSA - scope - DigitalSignatures:": "Digital signatures: sign messages (using the private key) and verify message signature (using the public key).",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms - RSA - scope - KeyExchange": "Key exchange: securely transport a secret key, used for encrypted communication later.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms - ECC": "Elliptic Curve Cryptography (ECC). ECC encryption is based on mathematical algorithms governing the algebraic structure of elliptic curves over finite fields. It provides equivalent levels of cryptographic strength as RSA and DSA, with shorter key lengths. ECC was the most recently-developed encryption method of the three, with Elliptic Curve Digital Signature Algorithm (ECDSA) becoming accredited in 1999, and Key Agreement and Key Transport Using Elliptic Curve Cryptography following in 2001. Like DSA, ECC is FIPS-certified, and is also endorsed by the National Security Agency (NSA).",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms - ECC - BrainpoolCurves": "",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Algorithms - ElGamal": "The ElGamal encryption system is a public key encryption algorithm by Taher Elgamal [3] in 1985 that is based on the Diffie-Hellman key exchange.",
	"Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Homomorphic": "Homomorphic encryption is a form of encryption that allows computations to be performed on encrypted data without first having to decrypt it.",
	"Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Encryption - Reencryption - Proxy": "Proxy re-encryption (PRE) schemes are cryptosystems which allow third parties (proxies) to alter a ciphertext which has been encrypted for one party, so that it may be decrypted by another.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification": "",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification - Fraud": "",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification - Validity": "",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification - Validity - zkProofs": "The term ‘zero-knowledge’ was first cited in a research paper in 1985, and since then this has been used to define the interaction of zero-knowledge protocols used in real-world applications.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification - Validity - parties": "",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification - Validity - parties - prover": "",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification - Validity - parties - verifier": "",
	"Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification - Validity - zkProofs - Types - Zk-SNARKs": "Short for Zero-Knowledge Succinct Non-Interactive Argument of Knowledge. ZK-SNARKs are an example of non-interactive proofs because the verifier and prover only communicate once.The zero-knowledge proofing system of ZK-SNARKs is quite small and with its constant time verification, it is known to be fast and cheap.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification - Validity - zkProofs - Types - Zk-STARKs": "Like ZK-SNARKs, ZK-STARKs is an abbreviation and it’s short for Zero-Knowledge Scalable Transparent Argument of Knowledge. ZK-STARKs are much more scalable as the time spent on computations is quasilinear to the complexity of the underlying computation and transparent than ZK-SNARKs, as it relies on publicly verifiable randomness.Although both ZK-STARKs and ZK-SNARKs prove the validity of off-chain transactions without revealing underlying data, ZK-SNARKs is hailed as an improvement on ZK-STARKs despite it being more expensive to verify transactions on the Ethereum network due to its larger proof size.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification - Validity - zkProofs - Types - ZkStack": "",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SingleKey - Verification - Pessimistic": "",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SplitKey": "",
	"Cryptography - Keys - Encryption - Asymmetric - Operations - SplitKey - Generation - DKG": "Distributed key generation (DKG) is a cryptographic process in which multiple parties contribute to the calculation of a shared public and private key set.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SplitKey - Distribution - SSS": "Shamir's Secret Sharing Scheme is a way of splitting a secret value S into n “pieces” (or “shares”) in such a way that any combination of k pieces can be used to recover S , but any k−1 or fewer pieces provide no information about S .",
	"Cryptography - Keys - Encryption - Asymmetric - Operations - SplitKey - Computation - MPC": "Splits a single private key into multiple cryptographic shares, eliminating single points of failure entirely.",
	"Cryptography - Keys - Encryption - Asymmetric - Operations - SplitKey - Verification - VSS": "Verifiable Secret Sharing (VSS) was used as an extension of SSS to remedy this, and it adds a verification step before key reconstruction. However, the key is still stored as a whole after reconstruction so the risk of stealing the key remains.",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - SplitKey - PKP": "Programmable Key Pairs (PKPs) are ECDSA public/private key pairs created by the Lit network using Distributed Key Generation (DKG). https://medium.com/@nwakanmachimekwa/getting-started-with-programmable-key-pairs-pkps-a-quick-start-session-on-how-to-start-using-dbc7c2d6111b",
  "Cryptography - Keys - Encryption - Asymmetric - Operations - MultiKey - MultiKey": "",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation": "Key encapsulation is a process where one party generates a shared secret and securely sends it to another party using asymmetric encryption. The recipient decrypts the encapsulated key to obtain the shared secret.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - features - mechanism": "Only one party generates the shared secret, and the other party passively receives it. One-way process",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - features - encryption": "Often used in hybrid encryption schemes, where the encapsulated key is used to encrypt data symmetrically.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM": ".",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - steps": ".",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - steps - KeyGeneration": "The receiver generates a public-private key pair.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - steps - Encapsulation": "The sender uses the receiver’s public key to generate a random symmetric key and encrypt it.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - steps - Transmission": "The encrypted symmetric key (ciphertext) is sent to the receiver.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - steps - Decapsulation": "The receiver uses their private key to decrypt the ciphertext and retrieve the symmetric key.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - steps - SecureCommunication": "The symmetric key is then used for fast and efficient encryption (e.g., AES) to exchange data securely.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - Classic - RSA-KEM": "Uses RSA encryption to encapsulate a symmetric key.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - Classic - ECIES": "Elliptic Curve Integrated Encryption Scheme (ECIES): Uses elliptic curve cryptography for key exchange.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC": ".",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - Kyber": "Kyber: A post-quantum KEM candidate for secure key exchange.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - Kyber - how": ".",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - Kyber - how - KeyGeneration": "A user generates a public key and a private key using Kyber's key generation algorithm.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - Kyber - how - Encapsulation": "Another user uses the public key to encapsulate a shared secret (symmetric key) into a ciphertext.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - Kyber - how - Decapsulation": "The recipient uses their private key to decapsulate the ciphertext and recover the shared secret.",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - X25519-ML/KEM": ".",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - Bike": ".",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - HQC": ".",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - McEliece": ".",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - NTRU": ".",
  "Cryptography - Keys - Encryption - Asymmetric - KeyEncapsulation - KEM - algorithms - PQC - Saber": ".",
  "Cryptography - Keys - Encryption - Asymmetric - Applications - Storage - DiskEncryption": "",
	"Cryptography - Keys - Encryption - Asymmetric - Applications - Connection - SSH": "A protocol for secure remote login and other secure network services.",
	"Cryptography - Keys - Encryption - Asymmetric - Applications - Transmission": "A Key Encapsulation Mechanism (KEM) is a cryptographic technique used in encryption systems to securely transmit symmetric encryption keys over an insecure channel. It is especially important in public-key encryption schemes.",
	"Cryptography - Keys - Management - KMS": "System or framework used to manage cryptographic keys throughout their lifecycle.",
  "Cryptography - Keys - Management - KMS - Functions": ".",
  "Cryptography - Keys - Management - KMS - Functions - KeyGeneration": "Creates cryptographic keys securely.",
  "Cryptography - Keys - Management - KMS - Functions - KeyStorage": "Safely stores keys, often in hardware security modules (HSMs) or encrypted databases.",
  "Cryptography - Keys - Management - KMS - Functions - KeyDistribution": "Distributes keys to authorized entities.",
  "Cryptography - Keys - Management - KMS - Functions - KeyRotation": "Periodically replaces keys to limit exposure.",
  "Cryptography - Keys - Management - KMS - Functions - KeyRevocation": "Invalidates compromised or outdated keys.",
  "Cryptography - Keys - Management - KMS - Functions - AccessControl": "Ensures only authorized users or systems can access keys.",
  "Cryptography - Keys - Management - KMS - Tools - AWS KMS": "AWS KMS",
  "Cryptography - Keys - Management - KMS - Tools - GoogleCloudKMS": "Google Cloud KMS",
  "Cryptography - Keys - Management - KMS - Tools - AzureKeyVault": "Azure Key Vault",

  "Cryptography - CommitmentScheme": "SECTION",
	"Cryptography - CommitmentScheme - desc": "Commitment Scheme allow to securely commit to a secret value, and reveal it afterwards, so third parties can check that the commitment agrees with the value revealed.",
  "Cryptography - CommitmentScheme - Phases": "A commitment scheme consists of two phases, Commit and Reveal, involving a deterministic polynomial-time algorithm",
  "Cryptography - CommitmentScheme - Phases - Commit": "Commit phase: in this stage, the sender commits to a binary value m by computing c = Comm(u, m) for a uniformly random binary u in and sending c to the receiver, who stores the result for later checking.",
  "Cryptography - CommitmentScheme - Phases - Reveal": "Reveal phase: in this stage, the sender opens c by sharing u and m with the receiver, who computes by himself c’ = Comm(u, m) and checks c’ = c.",
  "Cryptography - CommitmentScheme - Proposals": ".",
  "Cryptography - CommitmentScheme - Proposals - Pedersen": ".",
  "Cryptography - CommitmentScheme - Proposals - Elgamal": ".",
  "Cryptography - CommitmentScheme - Proposals - Switch": ".",
  "Cryptography - CommitmentScheme - Proposals - Vector": "Vector commitments allow committing concisely to an ordered sequence of values so that the values at desired positions can later be proved concisely.",

  "Cryptography - DigitalSignature": "SECTION",
	"Cryptography - DigitalSignature - desc": "Digital Signature is used to verify the authenticity and integrity of digital documents and messages.",
  "Cryptography - DigitalSignature - DSS": "A digital signature scheme (DSS) is a set of algorithms that take you through a three-stage process: KeyGen, Sign, Verify.",
  "Cryptography - DigitalSignature - Operations - SingleKey - Generate": "Generation of a public and private key pair. The private key allows a user to authorize transactions and proves ownership; the public key allows anyone to send digital assets to it. ",
  "Cryptography - DigitalSignature - Operations - SingleKey - Generate - Algorithms - Classic - RSADigitalSignature": ".",
  "Cryptography - DigitalSignature - Operations - SingleKey - Generate - Algorithms - Classic - RSA PSS": ".",
  "Cryptography - DigitalSignature - Operations - SingleKey - Generate - Algorithms - Classic - RSASSA PSS": ".",
  "Cryptography - DigitalSignature - Operations - SingleKey - Generate - Algorithms - Classic - DSA": "Digital Signature Algorithm. DSA encryption uses a different algorithm than RSA to create public key/private keys, based on modular exponentiation and the discrete logarithm problem. It provides the same levels of security as RSA for equivalent-sized keys. DSA was proposed by the National Institute of Standards and Technology (NIST) in 1991 and was adopted by the Federal Information Processing Standard (FIPS) in 1993.",
  "Cryptography - DigitalSignature - Operations - SingleKey - Generate - Algorithms - Classic - ECSADigitalSignature": "ECSA stands for Elliptic Curve Signature Algorithm. It is a digital signature scheme based on elliptic curve cryptography (ECC). ECSA is widely used for creating and verifying digital signatures, providing a secure and efficient way to ensure data integrity, authenticity, and non-repudiation. ECSA is an adaptation of the Digital Signature Algorithm (DSA) but uses elliptic curve cryptography instead of traditional modular arithmetic. It leverages the mathematical properties of elliptic curves to provide strong security with smaller key sizes compared to RSA or classical DSA.",
  "Cryptography - DigitalSignature - Operations - SingleKey - Generate - Algorithms - Classic - EdDSADigitalSignature": "Elliptic Curve Digital Signature Algorithm (ECDSA) offers a variant of the Digital Signature Algorithm (DSA) which uses elliptic-curve cryptography.",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign": "This algorithm, when given a message and a private key, generates a signature. ",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign - algorithms - PQC - Dilithium": "ML-DSA (FIPS 204, aka Dilithium). ML-DSA provides us with digital signing.",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign - algorithms - PQC - Sphincs": "SLH-DSA is a stateless hash-based signature scheme. SLH-DSA (FIPS 205, née SPHINCS) looks strictly worse, adding 39kB and significant computational overhead for both signing and verification. ",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign - algorithms - PQC - Falcon": "Falcon is a cryptographic signature algorithm submitted to NIST Post-Quantum Cryptography Project on November 30th, 2017.",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign - algorithms - PQC - INCCRoss": ".",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign - algorithms - PQC - SQiSign": ".",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign - algorithms - PQC - Hawk": ".",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign - algorithms - PQC - Perk": ".",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign - algorithms - PQC - Mayo": ".",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign - UseCases - Access": "",
  "Cryptography - DigitalSignature - Operations - SingleKey - Sign - UseCases - Transactions": "",
	"Cryptography - DigitalSignature - Operations - SingleKey - Verify": "The verification algorithm checks the message, public and private keys, and will verify the signature. It will either accept or reject it depending on authenticity.  ",
  "Cryptography - DigitalSignature - Operations - SingleKey - Verify - Schemes": "A signature scheme refers to the combination of a data encryption scheme and a digital signature scheme in an authenticated encryption scheme.",
  "Cryptography - DigitalSignature - Operations - SingleKey - Verify - Schemes - Classic - Schnorr": "A Schnorr signature is a digital signature produced by the Schnorr signature algorithm that was described by Claus Schnorr. Schnorr’s signature scheme [59] is an elegant digital signature scheme whose security is rooted in the hardness of computing discrete logarithms in a given group. Schnorr signatures offer several advantages over ECDSA, including smaller signature sizes, faster verification times, and improved resistance against certain types of attacks. Schnorr signatures also allow for signature aggregation, which can reduce transaction fees and improve scalability.",
  "Cryptography - DigitalSignature - Operations - SingleKey - Verify - Schemes - Classic - Schnorr - Variants": "All variants of Schnorr’s protocol prove the knowledge of an x such that  h = g x for a public h.",
  "Cryptography - DigitalSignature - Operations - SingleKey - Verify - Schemes - Classic - Schnorr - Variants - Batch-Schnorr": "",
  "Cryptography - DigitalSignature - Operations - SingleKey - Verify - Schemes - Classic - BLS": "BLS stands for Boneh-Lynn-Shacham, which is a digital signature scheme based on pairing-based cryptography. BLS signatures are known for their short signature size, efficiency, and unique properties that make them suitable for advanced cryptographic Protocols, such as aggregation and threshold signatures.",
  "Cryptography - DigitalSignature - Operations - SplitKey - Compute - Schemes - Classic - MPP - TSS": "Threshold Signature Scheme. A (t, n) threshold signature scheme (TSS) is a cryptographic protocol that allows a group of n participants to collectively sign documents or transactions.",
  "Cryptography - DigitalSignature - Operations - SplitKey - Compute - Schemes - Classic - MPP - TSS - vulnerabilities": "https://medium.com/@intuofficial/learning-from-the-past-mpc-vulnerabilities-how-intu-remains-unscathed-7a871e2bd249",
  "Cryptography - DigitalSignature - Operations - SplitKey - Compute - Schemes - Classic - MPP - TSS - GG18": "GG18 and GG20 are threshold signature protocols created by Rosario Gennaro and Steven Goldfeder. They allow digital signatures using ECDSA to be produced by a group without leaking private keys. GG18 was the first threshold signature protocol that allowed a group to sign transactions without needing a trusted central party. It used a type of encryption called Paillier to keep the signature shares private. But GG18 was slow, requiring lots of back and forth communication.",
  "Cryptography - DigitalSignature - Operations - SplitKey - Compute - Schemes - Classic - MPP - TSS - GG20": "GG20 made things much faster by only needing one round of communication to sign. It also added new capabilities like being able to identify if someone abruptly quit the protocol. GG20 became popular and was adopted along with GG18.",
  "Cryptography - DigitalSignature - Operations - SplitKey - Compute - Schemes - Classic - MPP - TSS - Lindell17": "Lindell17 is another protocol by Yehuda Lindell for signing transactions. It splits the private key between two participants who work together to create the signature.",
  "Cryptography - DigitalSignature - Operations - SplitKey - Compute - Schemes - Classic - MPP - TSS - DGC": "",
  "Cryptography - DigitalSignature - Operations - SplitKey - Compute - Schemes - Classic - MPP - TSS - EDDSA": "",
  "Cryptography - DigitalSignature - Operations - SplitKey - Compute - Schemes - Classic - MPP - TSS - DKLS19": "",
  "Cryptography - DigitalSignature - Operations - SplitKey - Compute - Schemes - Classic - MPP - TSS - MPC-CMP": "",
  "Cryptography - DigitalSignature - Operations - MultiSig": "Requires multiple private keys to approve transactions, reducing reliance on a single key.",
  "Cryptography - DigitalSignature - Libs - JCA": "",
  "Cryptography - DigitalSignature - UseCases - Documents": "",
  "Cryptography - DigitalSignature - UseCases - Documents - Embed": "",
  "Cryptography - DigitalSignature - UseCases - Documents - Sign": "Sign Documents",
  "Cryptography - DigitalSignature - UseCases - Documents - Sign - EU - XML-DSig": "",
  "Cryptography - DigitalSignature - UseCases - Documents - Sign - EU - XML-DSig - XAdES": "XML Advanced Electronic Signature, a set of extensions to the XML-DSig recommendations.",
  "Cryptography - DigitalSignature - UseCases - Documents - Sign - EU - CAdES": "CMS Advanced Electronic Signatures",
  "Cryptography - DigitalSignature - UseCases - Documents - Sign - EU - PAdES": "PDF Advanced Electronic Signatures",
  "Cryptography - DigitalSignature - UseCases - Documents - Sign - Tools - DocuSign": "",
  "Cryptography - DigitalSignature - UseCases - Messages - Sign": "",
  "Cryptography - DigitalSignature - UseCases - AppStore - Upload": "",
	"Cryptography - DigitalSignature - UseCases - Blockchain - Identification - Keys - Private - SeedPhrase": "",
  "Cryptography - DigitalSignature - UseCases - Blockchain - Transactions": "",
  "Cryptography - DigitalSignature - Regulations - eiDAS": "",

  "Cryptography - DigitalCertificate": "SECTION",
	"Cryptography - DigitalCertificate - desc": "Digital certificates or digital identification cards, are just like physical ID proofs. These certificates are files that use cryptography and PKI to authenticate the servers, devices, websites, etc.",
  "Cryptography - DigitalCertificate - Goals": "Apart from assuring the originality of the messages and identity verification, some other benefits of a digital signature include: Authentication, Integrity, Accountability",
  "Cryptography - DigitalCertificate - Goals - Authentication": "Though the sender’s identity in sending a message is known, the message may seem inaccurate or suspicious. Digital signatures are proofs of authenticity when they are attached to documents, and they are pivotal, especially in the case of financial transactions.",
  "Cryptography - DigitalCertificate - Goals - Integrity": "Digital messages can be compromised or altered by intruders in the absence of these signatures. Digital signatures safeguard the same, and in case of alteration of messages, the digital signature will become invalid. This cautions the recipient that the message is compromised. In this way, data integrity is assured for both parties.",
  "Cryptography - DigitalCertificate - Goals - Accountability": "Non-repudiation by the sender is not possible in the case of digital signatures, and this makes them accountable when a message is signed and sent by them.",
	"Cryptography - DigitalCertificate - Formats": "",
	"Cryptography - DigitalCertificate - Formats - X.509": "x509 is the name for certificates which are defined for: informal internet electronic mail, IPsec, and WWW applications X.509 certificates are often encoded in DER format.",
  "Cryptography - DigitalCertificate - Formats - ASN.1": "ASN.1 is a standard interface description language (IDL) for defining data structures that can be serialized and deserialized in a cross-platform way. ASN.1 defines the abstract syntax of information but does not restrict the way the information is encoded. Various ASN.1 encoding rules provide the transfer syntax (a concrete representation) of the data values whose abstract syntax is described in ASN.1.",
  "Cryptography - DigitalCertificate - File - EncondingFormats": ".",
  "Cryptography - DigitalCertificate - File - EncondingFormats - BER": ".",
  "Cryptography - DigitalCertificate - File - EncondingFormats - CER": ".",
  "Cryptography - DigitalCertificate - File - EncondingFormats - DER": "DER (Distinguished Encoding Rules) DER is a binary encoding format used to represent data structures in a standardized way. It is a subset of ASN.1 (Abstract Syntax Notation One), a language for defining data structures. DER ensures that the encoded data is unambiguous and can be parsed consistently across different systems.",
  "Cryptography - DigitalCertificate - File - EncondingFormats - DER - Purpose": "Encodes data structures in a binary format.",
  "Cryptography - DigitalCertificate - File - EncondingFormats - DER - Uses": ".",
  "Cryptography - DigitalCertificate - File - EncondingFormats - DER - Uses - DigitalCertificates": "",
  "Cryptography - DigitalCertificate - File - EncondingFormats - DER - Uses - CryptographicKeys": "RSA, ECC, and other keys are encoded in DER.",
  "Cryptography - DigitalCertificate - File - EncondingFormats - DER - Uses - PKCSStandards": "DER is used in PKCS#7 (CMS), PKCS#10 (Certificate Signing Requests), and other PKCS standards.",
  "Cryptography - DigitalCertificate - File - EncondingFormats - DER - Uses - ASN.1 Data Structures": "Any ASN.1-defined data structure can be encoded in DER.",
  "Cryptography - DigitalCertificate - File - EncondingFormats - CRT": ".",
  "Cryptography - DigitalCertificate - File - EncondingFormats - PEM": ".",
  "Cryptography - DigitalCertificate - File - EncondingFormats - P7B": "P7B/PKCS#7. Certificates in P7B/PKCS#7 formats are encoded in Base64 ASCII encoding and they usually have .p7b or .p7c as the file extension. The thing that separates PKCS#7 formatted certificates is that only certificates can be stored in this format, not private keys. In other words, a P7B file will only consist of certificates and chain certificates. The certificates having P7B/PKCS#7 format are contained between the “—–BEGIN PKCS7—–” and “—–END PKCS7—–” statements. Microsoft Windows and Java Tomcat are the most common platforms using this format for SSL certificates.",
  "Cryptography - DigitalCertificate - File - EncondingFormats - P7S": ".",
  "Cryptography - DigitalCertificate - File - EncondingFormats - PFX": "The PFX/P12/PKCS#12 format — all of which refer to a personal information exchange format — is the binary format that stores the server certificate, the intermediate certificate and the private key in a single password-protected pfx or .p12 file. These files are typically used on Windows platforms i to allow you to import and export certificates and private keys..",
  "Cryptography - DigitalCertificate - File - EncondingFormats - P12": ".",
	"Cryptography - DigitalCertificate - Management - PKI": "PKI is a comprehensive framework that enables the use of public-key cryptography for secure communication, authentication, and data integrity.",
  "Cryptography - DigitalCertificate - Management - PKI - OIDs": "An OID is a globally unique identifier used to name objects, concepts, or entities in various systems, including cryptography, telecommunications, and IT. OIDs are structured as a hierarchical sequence of numbers, where each number represents a node in the hierarchy.",
  "Cryptography - DigitalCertificate - Management - PKI - OIDs - Purpose": "Identifies objects, algorithms, or concepts.",	
	"Cryptography - DigitalCertificate - Management - PKI - Components": "",
	"Cryptography - DigitalCertificate - Management - PKI - Components - CA": "Certificate Authority (CA): A trusted entity that issues and verifies digital certificates.",
	"Cryptography - DigitalCertificate - Management - PKI - Components - DigitalCertificates": "Digital Certificates: Bind a public key to an entity (e.g., a person, organization, or device).",
	"Cryptography - DigitalCertificate - Management - PKI - Components - RA": "Registration Authority (RA): Verifies the identity of entities requesting certificates.",
	"Cryptography - DigitalCertificate - Management - PKI - Components - CRL": "Certificate Revocation List (CRL): A list of revoked certificates that are no longer valid.",
	"Cryptography - DigitalCertificate - Management - PKI - Components - Public/PrivateKeyPairs:": "Public/Private Key Pairs: Used for encryption, decryption, and digital signatures.",
	"Cryptography - DigitalCertificate - Management - PKI - Functions - Authentication": "Verifies the identity of entities.",
	"Cryptography - DigitalCertificate - Management - PKI - Functions - Encryption": "Secures data using public-key cryptography.",
	"Cryptography - DigitalCertificate - Management - PKI - Functions - Signatures": "Ensures data integrity and non-repudiation.",
	"Cryptography - DigitalCertificate - Management - PKI - Functions - KeyManagement": "Manages the lifecycle of cryptographic keys and certificates.",
  "Cryptography - DigitalCertificate - Management - PKI - Certificates": "",
  "Cryptography - DigitalCertificate - Management - PKI - Certificates - X509Certificate": "",
	"Cryptography - DigitalCertificate - UseCases - SSL": "Protocols used for secure communication over the internet.",
	"Cryptography - DigitalCertificate - UseCases - SSL - 3WayHandshake": "we have stuck with the 3-way handshake for many decades, and it is now seen as too slow in a modern “always-on, always-connected” world. In a normal Web connection, the client sends a SYN TCP request, the server then replies with a TCP SYN/ACK, and then the client sends back an ACK. This obviously slows down the connection, and where we might close a connection, and want it opened up again in a short interval. In fact, HTTP was meant to be stateless, and where we disconnect after a connection is made. Most browsers overcome this with a keep-alive packet.",
	"Cryptography - DigitalCertificate - UseCases - TLS": "Transport Layer Security (TLS) used for secure communication over the internet. TLS, which was formerly called SSL.",
	"Cryptography - DigitalCertificate - UseCases - TLS - Handshake - Steps - 1. ClientConnectsToServer": "",
	"Cryptography - DigitalCertificate - UseCases - TLS - Handshake - Steps - 2. ServePresentsTLSCertificate": "",
	"Cryptography - DigitalCertificate - UseCases - TLS - Handshake - Steps - 3. ClientVerifiesServerCertificate": "",
	"Cryptography - DigitalCertificate - UseCases - TLS - Handshake - Steps - 4. Exchange": "Client and server exchange information over encrypted TLS connection",
	"Cryptography - DigitalCertificate - UseCases - TLS - 0-RTT": "0-RTT (Zero Round Trip Time) and which is integrated into TLS 1.3. This will allow a client to immediately reconnect without the requirement for the three-way handshake. Basically, it allows data to be sent by a client without waiting for the server to respond.",
	"Cryptography - DigitalCertificate - UseCases - mTLS": "In mTLS, however, both the client and server have a certificate, and both sides authenticate using their public/private key pair. Compared to regular TLS, there are additional steps in mTLS to verify both parties",
	"Cryptography - DigitalCertificate - UseCases - mTLS - Goal": "mTLS helps ensure that traffic is secure and trusted in both directions between a client and server. This provides an additional layer of security",
	"Cryptography - DigitalCertificate - UseCases - mTLS - Handshake - Steps - 1. ClientConnectsToServer": "",
	"Cryptography - DigitalCertificate - UseCases - mTLS - Handshake - Steps - 2. ServePresentsTLSCertificate": "",
	"Cryptography - DigitalCertificate - UseCases - mTLS - Handshake - Steps - 3. ClientVerifiesServerCertificate": "",
	"Cryptography - DigitalCertificate - UseCases - mTLS - Handshake - Steps - 4. ClientPresentsTLSCertificate": "",
	"Cryptography - DigitalCertificate - UseCases - mTLS - Handshake - Steps - 5. ServerVerifiesClientCertificate": "",
	"Cryptography - DigitalCertificate - UseCases - mTLS - Handshake - Steps - 5. ServerGrantAccess": "",
	"Cryptography - DigitalCertificate - UseCases - mTLS - Handshake - Steps - 4. Exchange": "Client and server exchange information over encrypted TLS connection",
	"Cryptography - DigitalCertificate - UseCases - HTTPS": "",
	"Cryptography - DigitalCertificate - UseCases - HTTPS - Steps - 1. ClientRequest": "When a user types a website URL with 'https://', the web browser initiates a request to access the website securely. This initial request is a signal that the user wants a safe connection.",
	"Cryptography - DigitalCertificate - UseCases - HTTPS - Steps - 2. Handshake": "The web server responds by sending its SSL/TLS certificate, which contains its public key and identity. The browser verifies the certificate with a Certificate Authority (CA) to ensure that the server is legitimate. If the certificate passes, the browser proceeds with the secure communication process.",
	"Cryptography - DigitalCertificate - UseCases - HTTPS - Steps - 3. SessionKeyExchange": "After certificate validation, the browser generates a unique session key. This key is essential for encrypting data during the session. To ensure privacy, the browser encrypts this session key using the server’s public key and sends it back to the server, where only the server can decrypt it with its private key.",
	"Cryptography - DigitalCertificate - UseCases - HTTPS - Steps - 4. ServerDecryption": "Upon receiving the encrypted session key, the server uses its private key to decrypt it. This decryption allows both the browser and server to share the same session key, which will be used for encrypting the session data.",
	"Cryptography - DigitalCertificate - UseCases - HTTPS - Steps - 5. SecureConnection": "Now that both the browser and server have the session key, they establish a secure channel for communication. This session key is symmetric, meaning it's used for both encrypting and decrypting the data transferred between the browser and the server.",
	"Cryptography - DigitalCertificate - UseCases - HTTPS - Steps - 6. DataHandler": "Any data transmitted between the browser and the server is now encrypted with the session key. This ensures that even if the data is intercepted, it cannot be read or tampered with without the session key.",
	"Cryptography - DigitalCertificate - UseCases - HTTPS - Steps - 7. HTTPSCommunication": "Throughout the user's browsing session, all interactions between the client and the server occur over this secure, encrypted connection. This guarantees that sensitive information remains confidential, and the integrity of the data is maintained, protecting it from eavesdropping or tampering.",
	"Cryptography - DigitalCertificate - Email - PGP": "A program used for encrypting emails.",

	"Quantum": "SECTION",
  "Quantum - CBOM": "A Cryptographic Bill of Materials (CBOM) is an extension of the SBOM, and it goes into further detail to describe cryptographic components in the software and their dependencies. The components of a CBOM include the cryptographic algorithms and libraries used in the software products throughout your organization. It would include details such as their versions, and their dependencies on other software components and libraries. A CBOM can also contain metadata about the cryptographic algorithms and libraries, such as license information and known vulnerabilities.",
  "Quantum - PQC - NIST": "",
  "Quantum - Impact - Blockchain": "https://www.linkedin.com/pulse/quantum-computers-vs-blockchain-security-showdown-steve-vaile-imc3e/",
  "Quantum - Falcom": "",
  "Quantum - Dilithium": "",
  "Quantum - VPU": ""

}

