{

	"Network": "SECTION",
	"Network - AWS Regions": "",
	"Network - AWS Regions - AvailabilityZones": "Each Region has at least three Availability Zones.",
	"Network - AWS Regions - AvailabilityZones - descc": "Availability Zones (AZs) are isolated locations within an AWS Region.",
	"Network - AWS Regions - AvailabilityZones - multiple": "Each of the AWS regions has multiple Availability Zones implemented under them, and each availability zone is built to be isolated from any other.",
	"Network - AWS Regions - AvailabilityZones - location": "However, the naming doesn’t correspond with the real location of the physical data centre.",
	"Network - AWS Regions - AvailabilityZones - AZ ID": "Availability Zone names are unique and you can only use the ID for that account in those Availability Zones. It is across from all AWS accounts, with the same ID.",
	"Network - AWS VPC": "VPC (Virtual Private Cloud) – Secure, isolated network environment within AWS EBS (Elastic Block Store) – Persistent block storage for EC2 instances",
	"Network - AWS VPC - Subnets": "",
	"Network - AWS VPC - CIDRBlocks": "",
	"Network - AWS VPC - SecurityGroups": "",
	"Network - AWS VPC - NACLs": "",
	"Network - AWS InternetGateway": "An internet gateway serves as a highly available, redundant, and horizontally scaled gateway that facilitates two-way communication between your VPC resources and the internet. It functions at the VPC level, allowing resources residing in public subnets to initiate outbound connections and accept inbound connections from the internet",
	"Network - AWS InternetGateway - OutboundTraffic": "Resources with public IP addresses (EC2 instances, Elastic IP addresses) in your public subnets can leverage the internet gateway to connect to the internet for tasks like software updates, data transfers, or web service interactions.",
	"Network - AWS InternetGateway - InboundTraffic": "The internet gateway enables internet-based resources to initiate connections to your public subnet resources. This is crucial for web applications accessible from the public internet or services that receive data from external sources.",
	"Network - AWS NATGateway": "IGW supports two-way communication (both inbound and outbound), a NAT Gateway provides outbound-only access for resources in private subnets. The NAT Gateway ensures instances in private subnets can access the internet without exposing them to inbound traffic, making it a key component for secure, private workloads.",
	"Network - AWS RouteTable": "Configuring the route tables associated with your public subnets is essential for proper traffic routing. Modify the Route Table for your public subnets. Add a route that directs all outbound internet traffic (destination 0.0.0.0/0for IPv4 or ::/0 for IPv6) to the Internet Gateway. This ensures that all traffic headed for the internet will use the IGW as the exit point.",
	"Network - AWS RouteTable - Public": "This route table will be used for the public subnet to allow internet access.",
	"Network - AWS RouteTable - Private": "Now we create a route table for the private subnet.",
	"Network - AWS RouteS3": "Route 53 - Scalable domain name system with routing and health checks",
	"Network - AWS RouteS3 - Policies": "",
	"Network - AWS RouteS3 - Policies - SimpleRouting": "",
	"Network - AWS RouteS3 - Policies - LatencyRouting": "",
	"Network - AWS RouteS3 - Policies - FailoverRouting": "",
	"Network - AWS RouteS3 - Policies - GeolocationRouting": "",
	"Network - AWS RouteS3 - Policies - WeightedRouting": "",
	"Network - AWS RouteS3 - Policies - MultiValueAnswer": "",
	"Network - AWS ELB": "Elastic Load Balancing (ELB) automatically distributes incoming application traffic across multiple targets and virtual appliances in one or more Availability Zones (AZs).",
	"Network - AWS ALB": "A load balancer serves as the single point of contact for clients.",
	"Network - AWS APIGateway": "",
	"Network - AWS ThinkboxDeadline": "AWS Thinkbox Deadline 10 is flexible compute management software for render farms.",

	"Storage": "SECTION",
	"Storage - Fileystem - AWS S3": "S3 (Simple Storage Service) – Scalable object storage, perfect for backups, static assets, & more",
	"Storage - Fileystem - AWS EBS": "Persistem Block level Storage Volumes for EC2",
	"Storage - Fileystem - AWS EFS": "Amazon Elastic File System (EFS) provides a simple, scalable fully managed elastic NFS file system for AWS compute instances.",
	"Storage - Fileystem - AWS Glacier": "AWS Glacier is an affordable, long-term storage service designed for data that doesn’t need frequent access.",
	"Storage - Fileystem - AWS Glacier - Retrieval": "Retrieving data from AWS Glacier takes time—anywhere from minutes to hours, depending on your retrieval option.",
	"Storage - Fileystem - AWS Glacier - Retrieval - Options": "Unlike S3, you can’t just access files instantly—strategic retrieval planning saves money and time. ",
	"Storage - Fileystem - AWS Glacier - Retrieval - Options - Expedited": "Minutes",
	"Storage - Fileystem - AWS Glacier - Retrieval - Options - Standard": "Hours",
	"Storage - Fileystem - AWS Glacier - Retrieval - Options - Bulk": "Hours",
	"Storage - Fileystem - AWS Glacier - Costs": "Costs Are Low, But Retrieval Can Be Pricey. Storage is cheap, but if you need frequent access, the retrieval costs can add up fast.",
	"Storage - Fileystem - AWS Glacier - Transfers": "You Can Automate Transfers Lifecycle policies help move data from S3 to Glacier automatically, reducing manual work.",
	"Storage - Fileystem - AWS Glacier - Security": "Security is Built-In. AWS KMS encrypts your data by default, adding a layer of protection without extra effort.",
	"Storage - Fileystem - AWS Glacier - Different": "Glacier Isn’t One-Size-Fits-All. AWS offers different Glacier tiers, each with its own pricing and retrieval speed. Choose wisely.",
	"Storage - Fileystem - AWS Glacier - UseCases - Backups": ".",
	"Storage - Fileystem - AWS Glacier - UseCases - Compliance": "",
	"Storage - Fileystem - AWS Glacier - UseCases - Media": "",
	"Storage - Fileystem - AWS Glacier - UseCases - DisasterRecovery": ".",
	"Storage - Database - AWS TimeStream": "Time Series",
	"Storage - Database - AWS Neptune": "Graph DB",
	"Storage - Database - AWS DynamoDB": "Amazon DynamoDB is a fully managed, cloud-based NoSQL database service. It's designed to provide fast and predictable performance at any scale. DynamoDB is a key-value store that uses a JSON data model. ",
	"Storage - Database - AWS DocumentDB": "Managed MongoDB",
	"Storage - Database - AWS Keyspaces": "Amazon Keyspaces is a managed, serverless, and scalable database service for Apache Cassandra workloads on AWS. It allows you to run Cassandra applications without provisioning, patching, or managing servers. Keyspaces automatically scales tables up or down based on application traffic and charges you only for the resources you use. ",
	"Storage - Database - AWS Aurora": "Amazon Aurora is a fully managed, cloud-native relational database engine offered by AWS, compatible with MySQL and PostgreSQL, designed for high performance, scalability, and availability, and part of the Amazon Relational Database Service (RDS). ",
	"Storage - Database - AWS RDS": "Amazon RDS is the overlay technology that simplifies the process of configuring, managing, and optimizing your RDBMS.",
	"Storage - Database - AWS RDS - Supported": "MySQL, PostgreSQL, SQL Server, MariaDB, Oracle, and Aurora databases.",
	"Storage - Database - AWS Glue Data Catalog": "The AWS Glue Data Catalog is a centralized repository that stores metadata about your organization's data sets.",
	"Storage - DWH - AWS Redshift": "warehousing",
	"Storage - Cache - AWS ElasticCache": "Amazon ElastiCache is a fully managed in-memory data store and cache service by Amazon Web Services (AWS).",
	"Storage - Analytics - AWS Athena": "Amazon Athena is a serverless, interactive analytics service that provides a simplified and flexible way to analyze petabytes of data where it lives.",
	"Storage - Integration - AWS Storage Gateway": "Amazon Storage Gateway is a storage solution that you deploy on-premises, and allows you to integrate Amazon cloud storage with on-premise storage systems.",
	"Storage - Integration - AWS Storage Gateway - Protocols": "Use iSCSI, SMB, and NFS for diverse storage needs.",
	"Storage - Integration - AWS Storage Gateway - Gateways": "File, Tape, and Volume—each solving different storage challenges.",
	"Storage - Integration - AWS Storage Gateway - Gateways - File": ".",
	"Storage - Integration - AWS Storage Gateway - Gateways - Tape": "Tape Gateway Simulates Physical Tapes Perfect for long-term backups using Amazon S3 Glacier.",
	"Storage - Integration - AWS Storage Gateway - Gateways - Volume": "Volume Gateway Uses EBS Snapshots Easily restore and manage your block storage.",
	"Storage - Database - AWS Outposts": "",
	"Storage - AppStore - AWS Serverless Application Repository": "",

	"Middleware": "SECTION",
	"Middleware - AWS SQS": "Amazon SQS is a highly reliable, scalable message queuing service that enables asynchronous message-based communication between distributed components of an application.",
	"Middleware - AWS SQS - Reliability": "No message is ever lost in the interim, each message is persistently stored in highly available, highly reliable queues.",
	"Middleware - AWS SQS - Complexity": "SQS is dead-simple to use. Simply create a queue, and send messages to it.",
	"Middleware - AWS SQS - Queue Types": "Amazon SQS offers two queue types for different application requirements: Standard Queues and FIFO Queues",
	"Middleware - AWS SQS - Queue Types - Standard Queues": "",
	"Middleware - AWS SQS - Queue Types - Standard Queues - Throughput": "Unlimited Throughput: Standard queues support a nearly unlimited number of transactions per second (TPS) per API action.",
	"Middleware - AWS SQS - Queue Types - Standard Queues - Delivery": "At-Least-Once Delivery: A message is delivered at least once, but occasionally more than one copy of a message is delivered.",
	"Middleware - AWS SQS - Queue Types - Standard Queues - Ordering": "Best-Effort Ordering: Occasionally, messages might be delivered in an order different from which they were sent.",
	"Middleware - AWS SQS - Queue Types - Standard Queues - Use Cases": "",
	"Middleware - AWS SQS - Queue Types - FIFO Queues": "",
	"Middleware - AWS SQS - Queue Types - FIFO Queues - Throughput": "High Throughput: By default, FIFO queues support up to 300 messages per second (300 send, receive, or delete operations per second). When you batch 10 messages per operation (maximum), FIFO queues can support up to 3,000 messages per second. To request a limit increase, file a support request.",
	"Middleware - AWS SQS - Queue Types - FIFO Queues - Delivery": "Exactly-Once Processing: A message is delivered once and remains available until a consumer processes and deletes it. Duplicates aren't introduced into the queue.",
	"Middleware - AWS SQS - Queue Types - FIFO Queues - Ordering": "First-In-First-Out Delivery: The order in which messages are sent and received is strictly preserved (i.e. First-In-First-Out).",
	"Middleware - AWS SQS - Queue Types - FIFO Queues - Use Cases": "",
	"Middleware - AWS SNS": "",
	"Middleware - AWS Snowball": "",
	"Middleware - AWS Snowball Edge": "",
	"Middleware - AWS Snowball Family": "",
	"Middleware - AWS ECR": "",
	"Middleware - AWS StepFunctions": "",
	"Middleware - AWS AppMesh": "",
	"Middleware - AWS AppSync": "",

	"Compute": "SECTION",
	"Compute - AWS Lambda": "Serverless computing for lightweight microservices & automation",
	"Compute - AWS Lambda - Languages": "",
	"Compute - AWS Lambda - Languages - NodeJS": "",
	"Compute - AWS Lambda - Languages - Python": "",
	"Compute - AWS Lambda - Languages - Java": "",
	"Compute - AWS Lambda - Languages - Go": "",
	"Compute - AWS Lambda - Languages - C#": "",
	"Compute - AWS Lambda - Languages - PowerShell": "",
	"Compute - AWS Lambda - Languages - Ruby": "",
	"Compute - AWS Lambda - Invokation": "",
	"Compute - AWS Lambda - Invokation - by AWS services": "",
	"Compute - AWS Lambda - Invokation - by AWS services - S3": "S3Event",
	"Compute - AWS Lambda - Invokation - by AWS services - Kinesis": "KinesisEvent",
	"Compute - AWS Lambda - Invokation - by AWS services - SQS": "",
	"Compute - AWS Lambda - Invokation - by AWS services - SNS": "SNSEvent",
	"Compute - AWS Lambda - Invokation - by AWS services - Cognito": "CognitoEvent",
	"Compute - AWS Lambda - Invokation - by AWS services - DynamoDB": "DynamodbEvent",
	"Compute - AWS Lambda - Invokation - by AWS services - CloudTrail": "CloudTrail – Governance, compliance & auditing with detailed API logs",
	"Compute - AWS Lambda - Invokation - by API Gateway (HTTPS)": "APIGatewayProxyRequestEvent  - You can invoke AWS Lambda functions over HTTPS",
	"Compute - AWS Lambda - Invokation - by API Gateway - multiple": "You can do this by defining a custom REST API and endpoint using Amazon API Gateway, and then mapping individual methods, such as GET and PUT, to specific Lambda functions.",
	"Compute - AWS Lambda - Invokation - by API Gateway - unique": "You could add a special method named ANY to map all supported methods (GET, POST, PATCH, DELETE) to your Lambda function. When you send an HTTPS request to the API endpoint, the Amazon API Gateway service invokes the corresponding Lambda function.",
	"Compute - AWS Lambda - Invokation - by Custom Events": "",
	"Compute - AWS Lambda - Invokation - by Scheduled events": "",
	"Compute - AWS ServerlessApplicationModel": "AWS Serverless Application Model (AWS SAM) consists of two parts: AWS SAM templates and the AWS Serverless Application Model Command Line Interface (AWS SAM CLI).",
	"Compute - AWS Fargate": "AWS Fargate is a serverless, pay-as-you-go compute engine that lets you focus on building applications without managing servers. Serverless containers without infrastructure management",
	"Compute - AWS ECS": "On-demand scalable compute capacity for app hosting & deployments",
	"Compute - AWS ECS ": "https://ajmmertens.medium.com/building-an-ecs-storage-in-pictures-642b8bfd6e04",
	"Compute - AWS EC2 - Instances - R": "R = Memory Optimised. The “R” refers to optimised memory usage of each resource type. R instances are geared for workloads that require more memory in relation to the CPU.",
	"Compute - AWS EC2 - Instances - C": "C = Compute Optimised, and so on.",
	"Compute - AWS EC2 - Instances - M": "M Instances: general-purpose instances and provide a balanced amount of CPU, memory, and network resources.. Examples of M Instance Types: M5, M6g",
	"Compute - AWS ElasticBeanStalk": ".",
	"Compute - AWS ElasticInference": "Amazon Elastic Inference allows you to attach just the right amount of GPU-powered acceleration to any Amazon EC2 and Amazon SageMaker instance to reduce the cost of running deep learning inference by up to 75%. Amazon Elastic Inference supports TensorFlow, Apache MXNet, and ONNX models, with more frameworks coming soon. ",
	"Compute - AWS Batch": "",
	"Compute - AWS BatchComputeEnvironments": "",
	"Compute - AWS ComputeCluster": "",
	"Compute - AWS AppStream": "",
	"Compute - AWS Greengrass": "",

	"AI": "SECTION",
	"AI - ML - AWS SageMaker": "",
	"AI - AWS RoboMaker": "",

	"CICD - CI": "SECTION",
	"CICD - CI - Plan": "",
	"CICD - CI - Plan - AWS Config": "Continuous compliance & resource configuration tracking",
	"CICD - CI - Plan - AWS TrustedAdvisor": "",
	"CICD - CI - Code": "",
	"CICD - CI - Code - Development - AWS CodeCommit": "",
	"CICD - CI - Code - Cryptography - AWS KMS": "AWS KMS – Secure key management and encryption for sensitive data",
	"CICD - CI - Code - Cryptography - ACM": "AWS Certificate Manager (ACM) – Easy provisioning and management of SSL/TLS certificates",
	"CICD - CI - Code - Security ": "",
	"CICD - CI - Code - Security - AWS IAM": "IAM (Identity and Access Management) – User-level permission management & security",
	"CICD - CI - Code - Security - AWS IAM - SecurityGroups": "",
	"CICD - CI - Code - Security - AWS Cognito": "",
	"CICD - CI - Code - AWS Cloud9": "",
	"CICD - CI - Build - AWS CodeBuild": "",
	"CICD - CI - Package": "",
	"CICD - CI - Integrate": "",
	"CICD - CI - Test": "",

	"CICD - CD": "SECTION",
	"CICD - CD - Release": "",
	"CICD - CD - Release - AWS CodePipeline": "",
	"CICD - CD - Release - AWS AppRunner": "",
	"CICD - CD - Deploy - AWS CodeDeploy": "",
	"CICD - CD - Deploy - AWS CloudFront": "CloudFront – Global CDN for faster content delivery",
	"CICD - CD - Operate": "",
	"CICD - CD - Operate - Cloud": "",
	"CICD - CD - Operate - Cloud - AWS CDK": "",
	"CICD - CD - Operate - Cloud - AWS CloudFormation": "",
	"CICD - CD - Operate - Cloud - AWS EKS": "Amazon Elastic Kubernetes Service (Amazon EKS) is a fully managed Kubernetes service that enables you to run Kubernetes seamlessly in both AWS Cloud and on-premises data centers.",
	"CICD - CD - Operate - Cloud - AWS ECS": "Amazon Elastic Container Service (Amazon ECS) is a fully managed container orchestration service that helps you to more efficiently deploy, manage, and scale containerized applications.",
	"CICD - CD - Operate - Cloud - AWS CostExplorer": "Billing and Cost Explorer – Cost monitoring and budget optimization",
	"CICD - CD - Operate - Cloud - AWS Budget": "",
	"CICD - CD - Operate - Cloud - AWS SavingsPlans": "",
	"CICD - CD - Operate - Cloud - AWS ServerMigrationService": "",
	"CICD - CD - Operate - Cloud - AWS ParallelCluster": "AWS ParallelCluster is an AWS supported, open source cluster management tool that helps you to deploy and manage High-Performance Computing (HPC) clusters in the AWS Cloud.",
	"CICD - CD - Operate - Cloud - AWS Wavelegnth": "AWS Wavelength is an AWS infrastructure that allows you to deploy workloads closer to 5G-connected users and devices.",
	"CICD - CD - Operate - Cloud - AWS AutoScaling": "",
	"CICD - CD - Monitor": "",
	"CICD - CD - Monitor - AWS CloudWatch": "CloudWatch – Monitoring & logging system for performance and health metrics",
	"CICD - CD - Monitor - AWS CloudTrail": "",
	"CICD - CD - Monitor - AWS ELK": "ELK Stack on AWS – Real-time centralized log management and visualization",
	"CICD - CD - Monitor - AWS ComputeOptimizer": "",
	"CICD - CD - Automation": ""

}