{
	
	"SOLID": "SECTION",
	"SOLID Principles": "S.O.L.I.D., the first five principles of object-oriented programming. S.O.L.I.D. stands for: S - Single-responsibility principle, O - Open-closed principle, L - Liskov substitution principle, I - Interface segregation principle, D - Dependency Inversion Principle",
	"SOLID Principles. S - Single-responsibility principle": "Single-responsibility principle. This principle states that an object / class should only have one responsibility and that it should be completely encapsulated by the class. A reason to change",
	"SOLID Principles. O - Open-closed principle": "Software entities (classes, modules, functions, etc.) should be open for extension, but closed for modification. You will get loose coupling.",
	"SOLID Principles. L - Liskov substitution principle": "Defined by Barbara Liskov. Objects should be replaceable by instances of their subtypes without affecting the functioning of your system.",
	"SOLID Principles. I - Interface segregation principle": "Classes that implement interfaces, should not be forced to implement methods they do not use.",
	"SOLID Principles. D - Dependency Inversion Principle": "High level modules should not depend on low level modules.",

	"DDD": "SECTION",
	"DDD - description": ".",
	"DDD - components - Entities": "Entities are objects that have a distinct identity that runs through time and different states. The identity is usually represented by an ID.",
	"DDD - components - ValueObjects": "Value objects are objects that are defined by their attributes. They do not have a distinct identity.",
	"DDD - components - Repositories": "Repositories are used to retrieve and store entities. They act as a collection of entities.",
	"DDD - components - Factories": "Factories are used to create complex objects and aggregates.",
	"DDD - components - Aggregates": "Aggregates are clusters of entities and value objects that are treated as a single unit.",
	"DDD - components - Services": "Services contain business logic that doesn’t naturally fit within an entity or value object.",
	"DDD - components - Services - stateless": "1.Stateless: Services are typically stateless. They do not hold any state themselves but operate on the state of entities and value objects.",
	"DDD - components - Services - Encapsulation": "2.Encapsulation of Business Logic: They encapsulate business logic that spans multiple entities or value objects or that doesn’t fit neatly within a single entity or value object.",
	"DDD - components - Services - Coordination": "3.Coordination: They often coordinate interactions between multiple entities and value objects.",
	"DDD - components - DomainEvents": "Domain events are used to communicate changes in the state of the business.",
	"DDD - components - DomainEvents - published": "Where Domain Events Are Published:",
	"DDD - components - DomainEvents - published - EventBus": "1.Event Bus: Domain events are often published to an in-memory event bus within the application. This allows other parts of the application to subscribe to and handle these events. Since it is in-memory, the events are ephemeral and will be lost if the application restarts or crashes. It is suitable for scenarios where events need to be processed quickly and do not require persistence, such as inter-component communication within a single application instance.",
	"DDD - components - DomainEvents - published - EventStore": "2.Event Store: For more complex scenarios, domain events can be published to an event store, such as AWS EventBridge, Kafka, or a custom event store. This allows for durable storage and replay of events.",
	"DDD - components - DomainEvents - published - MessageBrokers": "3.Message Brokers: Domain events can also be published to message brokers like RabbitMQ or AWS SNS/SQS for asynchronous processing and integration with other systems.",

	"CleanCode": "SECTION",
	"CleanCode2": "https://azeynalli1990.medium.com/must-know-clean-code-principles-for-senior-devs-3f04d612bcad",

	"ECS": "SECTION",
	"ECS2": "https://ajmmertens.medium.com/building-an-ecs-storage-in-pictures-642b8bfd6e04"

}