{
			"Bamboo Concepts": "SECTION",
			"Bamboo - Concepts - Projects": "A project is a collection of plans. Projects enable you to easily group and identify plans which are logically related to each other. They are especially useful when generating reports across multiple plans.",
			"Bamboo - Concepts - Projects - Plan": "A plan defines everything about your continuous integration build process in Bamboo.",
			"Bamboo - Concepts - Projects - Plan - mission": "Processes a series of one or more stages that are run sequentially using the same repository.",
			"Bamboo - Concepts - Projects - Plan - config - plan details": "",
			"Bamboo - Concepts - Projects - Plan - config - stages": "Has a single stage, by default, but can be used to group jobs into multiple stages.",
			"Bamboo - Concepts - Projects - Plan - config - repository": "Specifies the default repository.",
			"Bamboo - Concepts - Projects - Plan - config - trigger": "Specifies how the build is triggered, and the triggering dependencies between the plan and other plans in the project.",
			"Bamboo - Concepts - Projects - Plan - config - branches": "Plan branches allow you to run builds across different branches in your source repository using the same plan configuration.",
			"Bamboo - Concepts - Projects - Plan - config - dependencies": "You can configure this plan to trigger child plans",
			"Bamboo - Concepts - Projects - Plan - config - permissions": "Specifies who has permission to view and configure the plan and its jobs.",
			"Bamboo - Concepts - Projects - Plan - config - notifications": "Specifies notifications of build results.",
			"Bamboo - Concepts - Projects - Plan - config - variables": "Provides for the definition of plan variables.",
			"Bamboo - Concepts - Projects - Plan - config - variables - appsList": "appsList which is set to ALL by default. This variable can be overriden when you run the bamboo plan customised. You can achieve to just deploy an specific list of apps (1 or more) and skip the apps you don't want to redeploy. This way it will take shorter to run the bamboo plan.",
			"Bamboo - Concepts - Projects - Plan - config - variables - server": "server which is set to the target dev server (saab, nova, paxton, ...) We won't need to override this variable as we have a plan for each pair dev server/weblogic domain.",
			"Bamboo - Concepts - Projects - Plan - config - miscelaneous": "",
			"Bamboo - Concepts - Projects - Plan - config - audit": "",
			"Bamboo - Concepts - Projects - Stage": "Stages group (or 'map') jobs to individual steps within a plan's build process",
			"Bamboo - Concepts - Projects - Stage - features - default": "By default has a single job but can be used to group multiple jobs.",
			"Bamboo - Concepts - Projects - Stage - features - processing": "Processes its jobs in parallel, on multiple agents (where available).",
			"Bamboo - Concepts - Projects - Stage - features - completion": "Must successfully complete all its jobs before the next stage in the plan can be processed.",
			"Bamboo - Concepts - Projects - Stage - features - output": "May produce artifacts that can be made available for use by a subsequent stage.",
			"Bamboo - Concepts - Projects - Stage - config - stage name": "",
			"Bamboo - Concepts - Projects - Stage - config - stage description": "",
			"Bamboo - Concepts - Projects - Stage - config - manual stage": "",
			"Bamboo - Concepts - Projects - Job": "A Bamboo job is a single build unit within a plan. One or more jobs can be organized into one or more stages. The jobs in a stage can all be run at the same time, if enough Bamboo agents are available. A job is made up of one or more tasks.",
			"Bamboo - Concepts - Projects - Job - mission": "Processes a series of one or more tasks that are run sequentially on the same agent.",
			"Bamboo - Concepts - Projects - Job - config - job details": "Each new plan created in Bamboo contains at least one job known as the 'Default Job'.",
			"Bamboo - Concepts - Projects - Job - config - tasks": "",
			"Bamboo - Concepts - Projects - Job - config - tasks - order": "Controls the order in which tasks are performed.",
			"Bamboo - Concepts - Projects - Job - config - tasks - parallel": "The jobs in a stage can all be run at the same time, if enough Bamboo agents are available.",
			"Bamboo - Concepts - Projects - Job - config - requirements": "Collects the requirements of individual tasks in the job, so that these requirements can be matched with agent capabilities.",
			"Bamboo - Concepts - Projects - Job - config - artifacts": "Defines the artifacts that the build will produce. Specifies any labels with which the build result or build artifacts will be tagged. Can only use artifacts produced in a previous stage.",
			"Bamboo - Concepts - Projects - Job - config - miscelaneus": "",
			"Bamboo - Concepts - Projects - Task": "Task is a small discrete unit of work, such as source code checkout, executing a Maven goal, running a script, or parsing test results. Is run sequentially within a job on a Bamboo working directory. Tasks may make use of an executable if required. A job can be configured to execute a number of tasks, on the same working directory.",
			"Bamboo - Concepts - Projects - Task - types": "",
			"Bamboo - Concepts - Projects - Task - types - Command": "",
			"Bamboo - Concepts - Projects - Task - types - SCP Task": "",
			"Bamboo - Concepts - Projects - Task - types - Script Task": "",
			"Bamboo - Concepts - Projects - Task - types - SSH Task": "",
			"Bamboo - Concepts - Projects - Task - types - Clean Working Directory": "",
			"Bamboo - Concepts - Projects - Task - types - Source Code Checkout": "",
			"Bamboo - Concepts - Projects - Task - types - JUnit Parser": "",
			"Bamboo - Concepts - Projects - Task - types - Maven 1.x": "",
			"Bamboo - Concepts - Projects - Task - types - Maven 2.x": "",
			"Bamboo - Concepts - Projects - Task - types - Maven 3.x": "",
			"Bamboo - Concepts - Projects - Task - types - NodeJS": "",
			"Bamboo - Concepts - Projects - Task - types - Deploy Tomcat Application": "",
			"Bamboo - Concepts - Projects - Task - types - Start Tomcat Application": "",
			"Bamboo - Concepts - Projects - Task - types - Stop Tomcat Application": "",
			"Bamboo - Concepts - Projects - Task - config": "",
			"Bamboo - Concepts - Build": "A build is the execution of either a plan or a job. The execution of a plan is referred to as a 'plan build' and that of a job is a 'job build'.",
			"Bamboo - Concepts - Build - Agent": "A Bamboo agent is a service that can run job builds.",
			"Bamboo - Concepts - Build - Agent - types - local agents": "local agents run as part of the Bamboo server. Local agents run in the Bamboo server's process, i.e. in the same JVM as the server.",
			"Bamboo - Concepts - Build - Agent - types - remote agents": "remote agents run on computers, other than the Bamboo server, that run the remote agent tool.  Each remote agent runs in its own process, i.e. has its own JVM.",
			"Bamboo - Concepts - Build - Agent - types - elastic agents": "elastic agents run in the Amazon Elastic Compute Cloud (EC2).",
			"Bamboo - Concepts - Build - Agent - Capability": "Each agent has a defined set of capabilities and can only run builds for jobs whose requirements match the agent's capabilities. Capabilities typically define the path to an executable.",
			"Bamboo - Concepts - Build - Agent - Capability - multiplicity": "Capabilities can be defined specifically for an agent, or they can be shared between either all local agents or all remote agents. Note that the value of an agent-specific capability overrides the value of a shared capability of the same name (if one exists).",
			"Bamboo - Concepts - Build - Agent - Executable": "An executable is an external program that Bamboo uses during the build process. Generally, executables compile source code to generate compiled executable files (referred to as artifacts in Bamboo). Ant, Maven, MSBuild or PHPUnit are just some examples of executables that can be used as part of your build process.",
			"Bamboo - Concepts - Build - Agent - Artifact": "Artifacts are files created by a job build (e.g. JAR files). Artifact definitions are used to specify which artifacts to keep from a build and are configured for individual jobs.",			
			"Bamboo - Concepts - Build Result": "Every completed build has a build result:",
			"Bamboo - Concepts - Build Result - Successful": "'Successful' — the code compiled, with or without errors, and all tests completed successfully.",
			"Bamboo - Concepts - Build Result - Failed": "'Failed' — either the code did not compile, or at least one test failed.",
			"Bamboo - Concepts - Build Result - Incomplete": "'Incomplete' — the build was not completed, e.g. it may have been stopped manually.",
			"Bamboo - Concepts - Build Status": "",
			"Bamboo - Concepts - Build Status - Broken": "if the build result is 'Failed', and the previous build result was 'Successful', the build is said to be 'Broken'.",
			"Bamboo - Concepts - Build Status - Fixed": "if the build result is 'Successful', and the previous build result was 'Failed', the build is said to be 'Fixed'.",

			"Bamboo Dashboard": "SECTION",
			"Bamboo - Dashboard": "The dashboard is your Bamboo 'home' page",
			"Bamboo - Dashboard - My Bamboo": "a convenient summary of information that is relevant to you (only appears if you have logged in to Bamboo): plans that you have nominated as your favorites, your latest build results (i.e. builds that were triggered by your latest code changes), a summary of your build statistics (only appear if your Bamboo User Profile has been associated with your Author Name",
			"Bamboo - Dashboard - Builds - All build plans": "a list of plans and each plan's latest build result",
			"Bamboo - Dashboard - Builds - Build Activity": "Bamboo's agents and build queue, showing which plans Bamboo is currently building and which plans are waiting to be built.",
			"Bamboo - Dashboard - Deploy": "",
			"Bamboo - Dashboard - Reports": ""
}