{

	"Runtime": "SECTION",
	"Runtime 0": "https://medium.com/@martin.musinn/event-loop-explained-76be3bd438af",
	"Runtime 1": "",
	"Runtime - EventLoop": "",
	"Runtime - EventLoop - location": "The event loop is not part of the JS engine like V8. The event loop is provided by the environment of the browser, or Node.js.",
	"Runtime - EventLoop - parts": "The event loop is responsible for handling the task queue, while the JS engine, such as V8, Spider Monkey, etc, manages the call stack.",
	"Runtime - EventLoop - how": "An event loop is something that pulls stuff out of the queue and places it onto the function execution stack whenever the function stack becomes empty. The event loop is the secret by which JavaScript gives us an illusion of being multithreaded even though it is single-threaded.",
	"Runtime - EventLoop - priority": "Each task has a task type, and tasks of the same type must be in one queue, while tasks of different types belong to different queues. In a single event loop cycle, the browser can select tasks from different queues to execute based on the actual situation. The queues include ones for DOM manipulation, user interaction, network requests, webpage navigation and history traversal, rendering.",
	"Runtime - EventLoop - priority - async - CallbackQueue:": "Asynchronous operations, such as I/O operations or timers, are handled by the browser or Node.js runtime. When these operations are complete, corresponding functions (callbacks) are placed in the callback queue.",
	"Runtime - EventLoop - priority - async - CallbackQueue - execution": "When an asynchronous operation is complete, its callback is placed in the callback queue.",
	"Runtime - EventLoop - priority - async - CallbackQueue - priority": "For async tasks in JavaScript EventLoop, there is also the concept of priority. https://programming.earthonline.us/can-you-answer-this-senior-level-javascript-promise-interview-question-69f7b6ffc2e7",
	"Runtime - EventLoop - priority - async - CallbackQueue - priority - microtasks": "Tasks with higher priority are called microtasks. Includes: Promise, ObjectObserver, MutationObserver, process.nextTick, async/await.",
	"Runtime - EventLoop - priority - async - CallbackQueue - priority - microtasks - interaction": "High priority. Used for event handling tasks generated after actions.",
	"Runtime - EventLoop - priority - async - CallbackQueue - priority - microtasks - Promise": "higher priority",
	"Runtime - EventLoop - priority - async - CallbackQueue - priority - microtasks - async/await": "higher priority",
	"Runtime - EventLoop - priority - async - CallbackQueue - priority - microtasks - Observer": "higher priority. ObjectObserver, MutationObserver",
	"Runtime - EventLoop - priority - async - CallbackQueue - priority - macrotasks": "Tasks with lower priority are called macrotasks. Includes: setTimeout , setInterval and XHR.",
	"Runtime - EventLoop - priority - async - CallbackQueue - priority - macrotasks - setTimeout": "Medium priority. Used for callback tasks triggered by timers reaching their deadlines.",
	"Runtime - EventLoop - priority - async - CallbackQueue - priority - macrotasks - network": "Medium priority. Used for tasks generated by network activity.",
	"Runtime - EventLoop - priority - async - CallbackQueue - priority - deprecated": "However, due to the rapid increase in browser complexity, W3C has abandoned the use of the term macrotask.",
	"Runtime - EventLoop - priority - execution - CallStack": "JavaScript uses a call stack to keep track of the currently executing function (where the program is in its execution)",
	"Runtime - EventLoop - priority - execution - CallStack - top": "The function on top of the call stack is executed. If this function contains asynchronous code, it might initiate further asynchronous operations.",
	"Runtime - EventLoop - priority - execution - CallStack - priority": "The event loop continuously checks the call stack (current task) and the callback queue (asyncs). If the call stack is empty, it takes the first function from the callback queue and pushes it onto the call stack for execution.",
	"Runtime - EventLoop - priority - execution - CallStack - Repeat": "The event loop continues this process, ensuring that the call stack is always empty before taking the next function from the callback queue.",

	"Engines": "SECTION",
	"Engines - SpiderMonkey": "",
  "Engines - SpiderMonkey ": "Mozilla Firefox. SpiderMonkey is the first JavaScript engine, written by Brendan Eich at Netscape Communications, later released as open-source and currently maintained by the Mozilla Foundation. It is still used in the Firefox web browser.",
	"Engines - Chakra": "",
	"Engines - Chakra ": "Chakra is a JScript engine developed by Microsoft. It is proprietary software. It is used in the Internet Explorer web browser. A distinctive feature of the engine is that it JIT compiles scripts on a separate CPU core, parallel to the web browser.",
	"Engines - GoogleV8": "",
  "Engines - GoogleV8 ": "The V8 engine is used inside Chrome and Node.js for example. V8 is a JavaScript engine developed by the Chromium Project for Google Chrome and Chromium web browsers. It is a JavaScript engine that can run standalone, or be embedded into any C++ application.",
	"Engines - Webkit": "",
  "Engines - Webkit ": "WebKit is developed by Apple and used in its Safari web browser, as well as all iOS web browsers. It is used by the BlackBerry Browser, PlayStation consoles beginning from the PS3, the Tizen mobile operating systems, and a browser included with the Amazon Kindle e-book reader..",

  "Environments": "SECTION",
  "Environments - NodeJS - 2009": "released",
  "Environments - NodeJS - engine": "NodeJS which is a runtime environment built on top of V8 Engine",
	"Environments - NodeJS - Features - Node Green": "The website https://node.green/ provides an excellent overview over supported ECMAScript features in various versions of Node.js, based on kangax's compat-table",
	"Environments - NodeJS - Data - WebStorageAPI - Node23": "An experimental implementation of the Web Storage API is now available, providing localStorage and sessionStorage functionalities within Node.js.",
	"Environments - NodeJS - Data - WebStorageAPI - localStorage": "",
	"Environments - NodeJS - Data - WebStorageAPI - sessionStorage": "",
	"Environments - NodeJS - Data - SQLLite - Node23": "Node.js 23 introduces experimental support for interacting with SQLite databases using native Node.js APIs, simplifying database management without relying on external libraries like sqlite3.",
	"Environments - NodeJS - Logic - WebStreamsAPI - ReadableStream": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - ReadableStreamDefaultReader": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - ReadableStreamBYOBReader": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - ReadableStreamDefaultController": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - ReadableByteStreamController": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - ReadableStreamBYOBRequest": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - WritableStream": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - WritableStreamDefaultWriter": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - WritableStreamDefaultController": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - TransformStream": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - TransformStreamDefaultController": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - ByteLengthQueuingStrategy": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - CountQueuingStrategy": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - TextEncoderStream": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - TextDecoderStream": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - CompressionStream": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - DecompressionStream": "",
	"Environments - NodeJS - Logic - WebStreamsAPI - Consumers": "",
	"Environments - NodeJS - Logic - Async": "",
	"Environments - NodeJS - Logic - Async - AsyncLocalStorage": "Async context provides a way to handle asynchronous operations more gracefully, preserving the context across async calls, making debugging and tracing easier. A go-to feature for backend developers working with Node.js and complex async operations. AsyncLocalStorage  is a Node.js API (based on the async_hooks API) that is used to create asynchronous state within callbacks and promise chains.",
	"Environments - NodeJS - Logic - IO - Libuv": "Libuv is an open-source, multi-platform support library that provides asynchronous I/O capabilities.",
	"Environments - NodeJS - Logic - IO - Libuv - features - async": "Libuv was created to address the need for efficient, cross-platform, asynchronous I/O in Node.js.",
	"Environments - NodeJS - Logic - IO - Libuv - features - ThreadPool": "For operations that cannot be performed asynchronously (like certain file I/O operations on some platforms), Libuv uses a thread pool.",
	"Environments - NodeJS - Logic - IO - Libuv - features - crossplatform": "Libuv abstracts away the differences between operating systems, providing a consistent API for asynchronous operations. This ensures that Node.js applications run consistently across different environments, including Windows, macOS, and Linux.",
	"Environments - NodeJS - Logic - IO - Libuv - components - Timers": "",
	"Environments - NodeJS - Logic - IO - Libuv - components - FileSystem": "",
	"Environments - NodeJS - Logic - IO - Libuv - components - FileSystem - fs": "when dealing with modules like fs (file system), crypto, or networking features like HTTP, Node.js taps into a library called libuv. Libuv provides access to OS-level features, including threading.",
	"Environments - NodeJS - Logic - IO - Libuv - components - NetworkOperations": "Libuv supports asynchronous network operations, enabling Node.js to handle network communication efficiently.",
	"Environments - NodeJS - Logic - IO - Libuv - components - DNSOperations": "Libuv provides asynchronous DNS operations, enabling Node.js to perform DNS resolution without blocking the event loop.",
	"Environments - NodeJS - CICD - Bundling - ESM - Node23": "Experimental ESM integration.",
	"Environments - NodeJS - CICD - Bundling - package - package.json": "It acts as a map for Node and npm (Node Package Manager), telling them what your project is, what dependencies it requires, how it should be run, and much more.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - fields - name": "The name of your project, which must be unique if you plan to publish it on npm.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - fields - version": "Specifies the current version of your project. This follows semantic versioning (e.g., 1.0.0).",
	"Environments - NodeJS - CICD - Bundling - package - package.json - fields - description": "A brief description of your project, helping others understand its purpose.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - fields - main": "Specifies the entry point of your application, usually a file like index.js.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - fields - author": "Your name or the name of your organization.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - fields - license": "Specifies the licensing terms for your project, such as MIT, GPL, or proprietary.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - fields - keywords": "An array of keywords to help people discover your project.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - fields - repository": "Links to the project’s source code repository.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - fields - bugs": "Provides an issue-tracking URL.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - fields - homepage": "The homepage URL for the project.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - Dependencies": "Dependencies are the external libraries or packages your project needs to function.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - Dependencies - dependencies": "These are required for your application to run. For example, express might be a dependency if you’re building an API.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - Dependencies - devDependencies": "These are only needed during development. For instance, a testing library like mocha could be listed here.",
	"Environments - NodeJS - CICD - Bundling - package - package.json - scripts": "Scripts allow you to automate common tasks like starting the server, running tests, or building the project.",
  "Environments - NodeJS - CICD - Building - GoogleV8": "Node.js is built on Google’s V8 engine, which compiles JavaScript into native machine code.",
  "Environments - NodeJS - CICD - Building - SWC": "SWC (stands for Speedy Web Compiler ) is a super-fast TypeScript / JavaScript compiler written in Rust.",
  "Environments - NodeJS - CICD - Building - SWC - WASM": "WebAssembly (WASM).",
  "Environments - NodeJS - CICD - Building --experimental-strip-types": "A few days ago, the tech community woke up to the news that the experimental --experimental-strip-types flag has been added to Node.js, currently available in the Node 23 nightly build. This development allows developers to write TypeScript code using .ts files in Node.js without the need for a compile step. Previously, running TypeScript in Node.js required a build process to transpile TypeScript into JavaScript. This new feature eliminates that necessity, enabling direct execution of TypeScript files.",
	"Environments - NodeJS - CICD - Execution - threading - SingleThreaded": "Node.js runs your JavaScript code (your application’s logic) on a single thread. All your event handlers and callbacks are executed here.",
	"Environments - NodeJS - CICD - Execution - threading - SingleThreaded - EventLoop": "The reason Node.js can handle multiple operations even with a single thread lies in its Event Loop. The Event Loop is an architectural model that allows Node.js to perform asynchronous operations by offloading time-consuming tasks to background processes (like the thread pool or the OS).",
	"Environments - NodeJS - CICD - Execution - threading - SingleThreaded - EventLoop - blokcking": "Operations like reading large files synchronously or running complex computations directly in your Node.js code will block the event loop. Since the event loop can only handle one task at a time, any blocking task will make the server unresponsive to incoming requests.",
	"Environments - NodeJS - CICD - Execution - threading - SingleThreaded - EventLoop - blokcking - syncIO": "Use asynchronous methods like `fs.readFile()` instead of `fs.readFileSync()`.",
	"Environments - NodeJS - CICD - Execution - threading - SingleThreaded - EventLoop - blokcking - heavy": "Offload heavy computations to worker threads or use services like AWS Lambda for CPU-intensive tasks",
	"Environments - NodeJS - CICD - Execution - threading - SingleThreaded - EventLoop - blokcking - large": "Break up large tasks using `setImmediate()` or `process.nextTick()` to avoid freezing the event loop.",
	"Environments - NodeJS - CICD - Execution - threading - MultiThreaded": "For non-JavaScript tasks like file I/O, cryptography, and DNS lookups, Node.js offloads these to a thread pool managed by libuv.",
	"Environments - NodeJS - CICD - Execution - threading - MultiThreaded - non-blocking I/O": "Node.js uses non-blocking I/O to manage concurrency. This means when an I/O task is requested (e.g., reading from a database or file), Node.js doesn’t sit idle waiting for the result. Instead, it hands off the task to the OS and moves on to the next request. This architecture allows Node.js to handle thousands of concurrent connections efficiently.",
	"Environments - NodeJS - CICD - Execution - threading - MultiThreaded - threadpool": "For specific operations like file access, DNS lookups, or cryptography, Node.js makes use of libuv’s thread pool to handle these blocking tasks. Each thread in the pool processes one task, and once complete, the results are sent back to the Event Loop.",
	"Environments - NodeJS - CICD - Execution - threading - MultiThreaded - threadpool - UV_THREADPOOL_SIZE": "You can control the size of this thread pool by setting the environment variable UV_THREADPOOL_SIZE.",
	"Environments - NodeJS - CICD - Execution - threading - Worker Threads": "For cases where the Event Loop and thread pool aren’t enough (particularly for CPU-heavy tasks), Node.js introduced Worker Threads. This allows you to run JavaScript code in parallel across multiple threads, truly leveraging multi-core processors. https://levelup.gitconnected.com/node-js-is-not-single-threaded-ae3d2f698a99",
	"Environments - NodeJS - CICD - Execution - Run - child_process": "The child_process module lets you execute shell commands directly within a JavaScript program, making it ideal for running scripts and automating tasks.",
	"Environments - NodeJS - CICD - Execution - Run - node --run": "running code snippets directly from the command line.",
	"Environments - NodeJS - CICD - Execution - Run - node -e": "running code snippets directly from the command line.",
	"Environments - NodeJS - CICD - Execution - ChildProcesses": "Node.js includes the child_process module, which has functions to create new processes.",
	"Environments - NodeJS - CICD - Execution - ChildProcesses - usage - os": ".",
	"Environments - NodeJS - CICD - Execution - ChildProcesses - usage - shell": ".",
	"Environments - NodeJS - CICD - Audit - Test - MockTimers": "The MockTimers API has reached stable status, offering comprehensive support for mocking Date and all major timers in Node.js.",
	"Environments - NodeJS - CICD - Audit - Test - node --test": "The built-in test runner now supports glob patterns for specifying test files, enhancing flexibility in test configuration.",
	"Environments - NodeJS - CICD - Audit - Debug - --inspect-brk": "The --inspect-brk flag in Node enables debugging by pausing execution on the first line, allowing you to connect to Chrome DevTools for a detailed inspection.",
	"Environments - NodeJS - CICD - Audit - Debug - --trace-warnings": "The --trace-warnings flag in Node provides detailed stack traces for warnings, which can help diagnose potential issues more effectively.",
	"Environments - NodeJS - CICD - Audit - Debug - --prof": "The --prof flag in Node enables the V8 profiler, which generates a detailed log that can be used for performance analysis of your script.",
	"Environments - deno": "",
	"Environments - deno2": "",
	"Environments - deno2 ": "https://javascript.plainenglish.io/deno-2-vs-node-js-is-this-the-end-of-10-million-node-js-users-d55d6649cb4d",
	"Environments - Bun": ""


}