{
	"Browser": "SECTION",
	"Browser ": "https://developer.mozilla.org/en-US/docs/Web/API",

	"Patterns": "SECTION",
	"Patterns - SPA": "",
	"Patterns - MPA": "",
	"Patterns - MFE": "Micro Frontends (MFE) is an architectural pattern where a frontend application is decomposed into smaller, semi-independent 'micro' applications. Each micro frontend is owned by a separate team and can be developed, tested, and deployed independently, while still integrating into a unified user interface.",

	"Data": "SECTION",
	"Data - Forms - FormDataAPI": "The FormData API is a web API that allows you to construct a set of key/value pairs representing form fields and their values, which can be sent using fetch or XMLHttpRequest",
	"Data - Forms - FormDataAPI - location": "placed in server or ServerAction",
	"Data - Forms - FormDataAPI - content": "contains all params of the form as title: formData.get('title')",
	"Data - Forms - FormDataAPI - destructuring": "const { title, amount } = Object.fromEntries(formData);",
	"Data - Forms - FormDataAPI - noreset": "return formData as default value to prevent reset",
	"Data - Forms - FormDataAPI - updates": "Since we only care about the value of the inputs on the submit event and not before, there’s no need for the change handler to update state. ",

	"View - Rendering": "SECTION",
	"View - Rendering - DOM": "The DOM is not part of the JavaScript language, but is instead a Web API which defines the structure and properties of elements on a webpage.",
	"View - Rendering - DOM - access": ".",
	"View - Rendering - DOM - access - minimize": "Accessing and manipulating the DOM can be slow. Minimize the amount of DOM access by caching references to elements and avoiding unnecessary changes.",
	"View - Rendering - DOM - access - batch": "Batch DOM Updates: Group multiple DOM updates together to reduce the number of reflows and repaints.",
	"View - Rendering - Markup - DocumentFragment": "https://javascript.plainenglish.io/stop-using-innerhtml-heres-the-secret-technique-netflix-engineers-use-for-dom-manipulation-5a53df44ba9e",
	"View - Rendering - Markup - DocumentFragment2": "https://xiuerold.medium.com/10-essential-javascript-optimization-techniques-for-lightning-fast-websites-f51cf5fd1df8",
	"View - Rendering - Markup - template": "The <template> tag allows you to define HTML content that isn’t rendered when the page loads. This content is stored in memory until it’s needed, making it perfect for scenarios where you want to prepare content but not display it immediately.",
  "View - Rendering - Markup - progress": ".",
  "View - Rendering - Markup - meter": ".",
  "View - Rendering - Markup - dfn": ".",
  "View - Rendering - Markup - dialog": ".",
  "View - Rendering - Markup - map": ".",
  "View - Rendering - Markup - area": ".",
  "View - Rendering - Markup - bdo": ".",
  "View - Rendering - Markup - base": ".",
  "View - Rendering - Markup - time": ".",
  "View - Rendering - Markup - hgroup": ".",
  "View - Rendering - Markup - kbd": ".",
  "View - Rendering - Markup - cite": ".",
	"View - Styling - CSS - ComponentBased": "Component-based CSS frameworks like Bootstrap provide pre-styled components (buttons, navbars, forms, etc.) that developers can use to quickly build a cohesive UI. This approach focuses on reusable, standardized components that help maintain consistency across a project.",
  "View - Styling - CSS - ComponentBased - Properties": "",
  "View - Styling - CSS - ComponentBased - Nesting": "",
  "View - Styling - CSS - ComponentBased - Modules": "",
	"View - Styling - CSS - ComponentBased - Bootstrap": "",
	"View - Styling - CSS - UtilityFirst": "Utility-first is a CSS methodology where you build up your styles using many small, purpose-specific classes.",
	"View - Styling - CSS - UtilityFirst - SOC": "Many critics consider Tailwind's utility-first approach an anti-pattern because it goes against the separation of concerns principle. Traditionally, HTML is for structure, CSS is for styling, and JavaScript is for behavior. Tailwind blends structure and styling, potentially leading to more tightly coupled code.",
	"View - Styling - CSS - UtilityFirst - TailwindCSS": "",
  "View - Styling - CSS - UtilityFirst - TailwindCSS - Signals": "Tailwind Signals is a new experimental feature in Tailwind CSS that enables custom state consumption by any descendant in the DOM for cleaner coding and efficient styling. Signals build on the concept of pseudo-classes and allow for bidirectional communication between parent and child components, enabling child components to react to state changes in their parents and vice versa.",
	"View - Styling - CSS - UtilityFirst - UnoCSS": "",
	"View - Styling - CSS - Preprocessors": "",
	"View - Styling - CSS - Preprocessors - SASS": "Syntactically Awesome Style Sheets",
	"View - Styling - CSS - Preprocessors - LESS": "Leaner Style Sheets",
	"View - Styling - CSS - Preprocessors - Stylus": "",
	"View - Styling - CSS - Preprocessors - Stylable": "",
	"View - Styling - CSS - Preprocessors - Stylis": "",
	"View - Styling - CSS - Preprocessors - Clay": "",
	"View - Styling - CSS - Preprocessors - Crush": "",
  "View - Styling - CSS - CSS-in-JS": "As the name suggests, CSS-in-JS allows programmers to style their components by writing CSS directly in their JavaScript or TypeScript code. ",
  "View - Styling - CSS - CSS-in-JS - advantages - scope": "All CSS-in-JS libraries generate unique CSS class names. Moreover, all styles are scoped to their respective component, providing encapsulation without affecting any styling defined outside the component. This eloquently avoids CSS class name collisions, specificity wars, and spending a lot of time to come up with unique class names across the entire application. Using CSS-in-JS scopes your styles to your components (no more accidental global styles!)",
  "View - Styling - CSS - CSS-in-JS - advantages - SSR": "",
  "View - Styling - CSS - CSS-in-JS - advantages - prefixes": "Automatic vendor prefixes: All CSS-in-JS libraries provide vendor prefixes out-of-the-box. This is a great time saver because developers do not have to figure out which features require a vendor prefix in older browsers.",
  "View - Styling - CSS - CSS-in-JS - drawbacks - overhead": "As components render, the CSS-in-JS library must convert styles into plain CSS to be inserted into the document.",
  "View - Styling - CSS - CSS-in-JS - drawbacks - size": "Every user who uses your application has to download the JavaScript for the CSS-in-JS library.",
  "View - Styling - CSS - CSS-in-JS - constants": "",
  "View - Styling - CSS - CSS-in-JS - constants - syntax - param": "style={{ backgroundColor: isHovered ? 'yellow' : 'lightgray', }}",
  "View - Styling - CSS - CSS-in-JS - constants - syntax - class": "<div style={styles}>",
  "View - Styling - CSS - CSS-in-JS - libs - fwSpecific": "only work with a specific JavaScript framework",
  "View - Styling - CSS - CSS-in-JS - libs - fwSpecific - Radium": "",
  "View - Styling - CSS - CSS-in-JS - libs - fwSpecific - StyledJSX": "Styled JSX uses template literals within the JSX syntax to add CSS styles to components.",
  "View - Styling - CSS - CSS-in-JS - libs - fwAgnostic": "you can use them with any component-based framework or even plain JavaScript",
  "View - Styling - CSS - CSS-in-JS - libs - fwAgnostic - StyledComponents": "Styled Components is a library for React and React Native that allows you to use component-level styles in your application. It leverages tagged template literals to style your components, providing a seamless integration of styles within your JavaScript.",
  "View - Styling - CSS - CSS-in-JS - libs - fwAgnostic - Emotion": "",
  "View - Styling - CSS - CSS-in-JS - libs - fwAgnostic - StyleX": "",
  "View - Styling - CSS - CSS-in-JS - libs - fwAgnostic - PandaCSS": "",
  "View - Styling - CSS - CSS-in-JS - libs - fwAgnostic - PigmentCSS": "",
  "View - Styling - CSS - CSS-in-JS - libs - fwAgnostic - KumaUI": "",
  "View - Styling - CSS - CSS-in-JS - libs - fwAgnostic - ParcelMacros": "",
  "View - Styling - CSS - CSS-in-JS - libs - compileTime - Linaria": "",
  "View - Styling - CSS - CSS-in-JS - libs - compileTime - CVA": "",
  "View - Styling - CSS - CSS-in-JS - libs - compileTime - astroturf": "",
  "View - Styling - CSS - CSS-in-JS - libs - compileTime - compiled": "",
	"View - Styling - Components - libs - Styled": "UI library which gives you access to lots of pre-built components which share the same design system, functionalities, and rules for accessibility",
  "View - Styling - Components - libs - Styled - MaterialUI": "",
  "View - Styling - Components - libs - Styled - MantineUI": "",
  "View - Styling - Components - libs - Styled - NGBootstrap": "",
  "View - Styling - Components - libs - Styled - NGXBootstrap": "",
  "View - Styling - Components - libs - Styled - OnSetUI": "",
  "View - Styling - Components - libs - Styled - Syncfusion": "",
  "View - Styling - Components - libs - Styled - VaddinUI": "",
  "View - Styling - Components - libs - Styled - KendoUI": "",
  "View - Styling - Components - libs - Styled - IgniteUI": "",
  "View - Styling - Components - libs - Styled - Devextreme": "",
  "View - Styling - Components - libs - Styled - Ng-zorro": "",
  "View - Styling - Components - libs - Styled - Nebular": "",
  "View - Styling - Components - libs - Styled - Clarity": "",
  "View - Styling - Components - libs - Styled - ChakraUI": "",
  "View - Styling - Components - libs - Styled - NextUI": "https://levelup.gitconnected.com/speed-up-next-js-development-with-nextui-27afcf983235",
  "View - Styling - Components - libs - Styled - ParkUI": "",
  "View - Styling - Components - libs - Styled - ReactBootstrap": "",
  "View - Styling - Components - libs - Styled - SemanticUI": "",
  "View - Styling - Components - libs - Styled - Reactstrap": "",
  "View - Styling - Components - libs - Styled - AntDesign": "",
  "View - Styling - Components - libs - Headless": "The trend moves towards headless UI libraries though. They come without styling, but with all the functionalities and accessibilities that a modern component library needs. Most of the time they are combined with a Utility-First-CSS solution like Tailwind",
  "View - Styling - Components - libs - Headless - ShadcnUI": "shadcn/UI is the first popular UI library which fully embraces Tailwind as first-class citizen (next to CSS Variables) for theming their components to achieve custom design. Following Tailwind in its footsteps, shadcn/UI is not installed as a node package, but rather copy and pasted into a project where one can freely adapt the components. https://levelup.gitconnected.com/using-5-new-shadcn-ui-components-in-next-js-14-8f4bc33d2911",
  "View - Styling - Components - libs - Headless - Radix": "",
  "View - Styling - Components - libs - Headless - ReactAria": "",
  "View - Styling - Components - libs - Headless - Catalyst": "",
  "View - Styling - Components - libs - Headless - DaisyUI": "",
  "View - Styling - Components - libs - Headless - HeadlessUI": "",
  "View - Styling - Components - libs - Headless - TailwindUI": "",
  "View - Styling - Components - libs - Headless - Primefaces": "",
  "View - Styling - Components - libs - Headless - Primefaces - PrimeNG": "",
  "View - Styling - Components - libs - Headless - Primefaces - PrimeFlex": "",
  "View - Styling - ShadowDOMAPI": "Shadow DOM enables you to attach a DOM tree to an element, and have the internals of this tree hidden from JavaScript and CSS running in the page.",
  "View - Styling - ShadowDOMAPI - ShadowDOM": ".",
  "View - Styling - ShadowDOMAPI - ShadowHost": ".",
  "View - Styling - Patterns - Relativistic - MouldableUI": "Mouldable UI is a design paradigm that emphasizes creating user interfaces capable of adapting to various contexts and user needs. https://levelup.gitconnected.com/from-atomic-design-to-relativistic-interfaces-0751b0b46832",
	"View - Animations - requestAnimationFrame": "Instead of using setTimeout or setInterval for animations, use requestAnimationFrame. This method synchronizes your animations with the browser’s refresh rate, resulting in smoother animations.",
	"View - Animations - transitions - ViewTransitionsAPI": "The View Transitions API can be used in two scenarios: Single Page Applications (SPAs) and Multi-Page Applications (MPAs).",
	"View - Animations - transitions - startViewTransition": "The startViewTransition() method of the Document interface starts a new same-document (SPA) view transition and returns a ViewTransition object to represent it.",

	"Logic - Events - browser - click": "",
	"Logic - Events - browser - dblclick": "",
	"Logic - Events - browser - mousedown": "",
	"Logic - Events - browser - mouseup": "",
	"Logic - Events - browser - mouseover": "",
	"Logic - Events - browser - mouseout": "",
	"Logic - Events - browser - keydown": "",
	"Logic - Events - browser - keyup": "",
	"Logic - Events - browser - keypress": "",
	"Logic - Events - browser - touchstart": "",
	"Logic - Events - browser - touchmove": "",
	"Logic - Events - browser - touchend": "",
	"Logic - Events - browser - submit": "",
	"Logic - Events - browser - change": "",
	"Logic - Events - browser - input": "",
	"Logic - Events - browser - load": "",
	"Logic - Events - browser - scroll": "",
	"Logic - Events - browser - resize": "",
	"Logic - Events - browser - beforeunload": "",
	"Logic - Events - browser - focus": "",
	"Logic - Events - browser - blur": "",
	"Logic - Events - browser - dragstart": "",
	"Logic - Events - browser - dragover": "",
	"Logic - Events - browser - drop": "",
	"Logic - Events - browser - animationstart": "",
	"Logic - Events - browser - animationend": "",
	"Logic - Events - browser - transitionend": "",
	"Logic - Devices - Connection": "navigator.connection",
	"Logic - Devices - Connection - speed": "navigator.connection.downlink",
	"Logic - Devices - Bluetooth": "navigator.bluetooth",
	"Logic - Devices - Camera": "navigator.mediaDevices",
	"Logic - Devices - Vibration": "navigator.vibrate",
	"Logic - Devices - Geolocation": "navigator.geolocation",
	"Logic - Devices - Battery": "navigator.getBattery()",
	"Logic - Devices - NFC": "new NFCReader()",
	"Logic - Devices - Payments": "new PaymentRequest(...)",
	"Logic - Devices - Share": "navigator.share",
	"Logic - Devices - Clipboard": "navigator.clipboard",
	"Logic - Devices - Orientation": "window.addListener('deviceorientation, handleOrientationFunction)",

	"Storage": "SECTION",
	"Storage - CookieStoreAPI": ".",
	"Storage - WebStorageAPI": "The Web Storage API provides mechanisms by which browsers can store key/value pairs, in a much more intuitive fashion than using cookies.",
	"Storage - WebStorageAPI - localStorage": "localStorage does the same thing, but persists even when the browser is closed and reopened.",
	"Storage - WebStorageAPI - sessionStorage": "sessionStorage maintains a separate storage area for each given origin that's available for the duration of the page session (as long as the browser tab is open, including page reloads and restores).",
	"Storage - IndexedDB": ".",

  "CICD - Applications - Authentication": "",
  "CICD - Applications - Authentication - custom - Token": "basic token-based authentication system using JSON Web Tokens (JWT): { 'token': 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9...' }",
  "CICD - Applications - Authentication - custom - Token - Types - JWT": "JSON Web Tokens are self-contained authentication tokens that carry identity data and are cryptographically signed.",
  "CICD - Applications - Authentication - custom - Token - Types - PASETO": "Platform-Agnostic Security Tokens improve upon JWT with stronger cryptography and fewer security configuration options. PASETO reduces security vulnerabilities by eliminating problematic algorithm choices and enforcing secure defaults.",
  "CICD - Applications - Authentication - custom - Token - Function": "",
  "CICD - Applications - Authentication - custom - Password": "",
  "CICD - Applications - Authentication - custom - Password - Function - SignIn": "It receives the form data from the client, retrieves the user by email, verifies the password, creates a session for the user, sets the session cookie in the user's browser, and redirects the user to the home page.",
  "CICD - Applications - Authentication - custom - Password - Function - SignUp": "It receives the form data from the client, hashes the password, creates a user and a session in the database, sets the session cookie in the user's browser, and redirects the user to the home page.",
  "CICD - Applications - Authentication - custom - Password - Function - SignOut": "It retrieves the session from the cookie, invalidates the session in the database, deletes the session cookie in the user's browser, and redirects the user to the sign in page.",
  "CICD - Applications - Authentication - custom - Password - Function - HashPassword": ".",
  "CICD - Applications - Authentication - custom - Password - Function - VerifyPassword": ".",
	"CICD - Applications - Authentication - custom - Cookie": "",
  "CICD - Applications - Authentication - custom - Session": "When a user signs up or signs in, we create a session for them. This session is stored in a database and a cookie with a session token is set in the user's browser. Whenever the user sends a request to the server, we validate the session and if everything is fine, we return the session and the user.",
  "CICD - Applications - Authentication - custom - Session - Function - CreateToken": "function which creates a random session token which will be used for the cookie",
  "CICD - Applications - Authentication - custom - Session - Function - CreateSession": "function which creates a session for a user when a user signs up/in. The function takes a sessionToken generated from generateRandomSessionToken and the userId of the user which allows us to create a session for the user",
  "CICD - Applications - Authentication - custom - Session - Function - ValidateSession": "function which validates a user's session whenever the user sends a request to the server. With every request the user sends to the server, which attempts to access a protected resource, we need to validate the session cookie.",
  "CICD - Applications - Authentication - custom - Session - Function - DeleteSession": "function which deletes a user's session when the user signs out.",
  "CICD - Applications - Authentication - custom - Session - Function - SetCookie": ".",
  "CICD - Applications - Authentication - custom - Session - Function - DeleteCookie": ".",
  "CICD - Applications - Authentication - custom - Session - Storage - Session": "If the cookie exists, we extract the session token from it and validate the session from the database. If the session is valid, we return the session and the user.",
  "CICD - Applications - Authentication - custom - Session - Storage - User": "you need to define the user and session schema.",
  "CICD - Applications - Authentication - libs - Firebase": "",
  "CICD - Applications - Authentication - libs - AWS Cognito": "",
  "CICD - Applications - Authentication - libs - Auth0": "",
  "CICD - Applications - Authentication - libs - Passport.js": "",
  "CICD - Applications - Authentication - libs - NextAuth": "",
  "CICD - Applications - Authentication - libs - Supabase": "",
  "CICD - Applications - Authentication - libs - Clerk": "",
  "CICD - Applications - Authentication - libs - Lucia": "",
  "CICD - Applications - Authentication - libs - AuthKit": "",

	"CICD - Execution - Environment - Google V8": "V8 is a browser engine",
	"CICD - Execution - Environment - Blink": "Google Blink Engine",
	"CICD - Execution - Environment - Webkit": "Apple Safari (webkit) is more power efficient Engine",
	"CICD - Execution - Environment - Chromium": "Apple macOS Chromium (blink) is faster",
	"CICD - Execution - Environment - Gecko": "Mozilla Firefox/Gecko Engine",
	"CICD - Execution - Environment - Gecko - Goanna": "fork of Firefox/Gecko",
	"CICD - Execution - Environment - Ladybird - 2024": "Google Blink Engine"

}